
iso/boot/kernel.bin:     file format elf32-i386

Contents of the .eh_frame section (loaded from iso/boot/kernel.bin):


00000000 00000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -4
  Return address column: 8
  Augmentation data:     1b
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_offset: r8 (eip) at cfa-4
  DW_CFA_nop
  DW_CFA_nop

00000018 0000001c 0000001c FDE cie=00000000 pc=0010404f..00104088
  DW_CFA_advance_loc: 5 to 00104054
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 00104056
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 49 to 00104087
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

00000038 0000001c 0000003c FDE cie=00000000 pc=00104088..001040b9
  DW_CFA_advance_loc: 5 to 0010408d
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 0010408f
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 41 to 001040b8
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

00000058 0000001c 0000005c FDE cie=00000000 pc=001040b9..00104137
  DW_CFA_advance_loc: 5 to 001040be
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 001040c0
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc1: 118 to 00104136
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop


  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 26 to 0010eacc
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

000024a4 0000001c 000024a8 FDE cie=00000000 pc=0010eacd..0010eaec
  DW_CFA_advance_loc: 5 to 0010ead2
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 0010ead4
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 23 to 0010eaeb
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

000024c4 0000001c 000024c8 FDE cie=00000000 pc=0010eaec..0010eb06
  DW_CFA_advance_loc: 5 to 0010eaf1
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 0010eaf3
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 18 to 0010eb05
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

000024e4 0000001c 000024e8 FDE cie=00000000 pc=0010eb06..0010eb20
  DW_CFA_advance_loc: 5 to 0010eb0b
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 0010eb0d
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 18 to 0010eb1f
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

00002504 0000001c 00002508 FDE cie=00000000 pc=0010eb20..0010eb3b
  DW_CFA_advance_loc: 5 to 0010eb25
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 0010eb27
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 19 to 0010eb3a
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

00002524 0000001c 00002528 FDE cie=00000000 pc=0010eb3b..0010eb56
  DW_CFA_advance_loc: 5 to 0010eb40
  DW_CFA_def_cfa_offset: 8
  DW_CFA_offset: r5 (ebp) at cfa-8
  DW_CFA_advance_loc: 2 to 0010eb42
  DW_CFA_def_cfa_register: r5 (ebp)
  DW_CFA_advance_loc: 19 to 0010eb55
  DW_CFA_restore: r5 (ebp)
  DW_CFA_def_cfa: r4 (esp) ofs 4
  DW_CFA_nop
  DW_CFA_nop

Contents of the .debug_info section (loaded from iso/boot/kernel.bin):

  Compilation Unit @ offset 0x0:
   Length:        0xb4d (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x308): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -g -fno-pie -ffreestanding -fasynchronous-unwind-tables -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1bf): src/kernel/vmem.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x162): /home/iliashdz/Desktop/Projects/apostrof
    <19>   DW_AT_low_pc      : 0x104c33
    <1d>   DW_AT_high_pc     : 0xa91
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_base_type)
    <26>   DW_AT_byte_size   : 1
    <27>   DW_AT_encoding    : 6	(signed char)
    <28>   DW_AT_name        : (indirect string, offset: 0x1ef): char
 <1><2c>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d>   DW_AT_byte_size   : 2
    <2e>   DW_AT_encoding    : 5	(signed)
    <2f>   DW_AT_name        : (indirect string, offset: 0x6f): short int
 <1><33>: Abbrev Number: 3 (DW_TAG_base_type)
    <34>   DW_AT_byte_size   : 4
    <35>   DW_AT_encoding    : 5	(signed)
    <36>   DW_AT_name        : int
 <1><3a>: Abbrev Number: 2 (DW_TAG_base_type)
    <3b>   DW_AT_byte_size   : 8
    <3c>   DW_AT_encoding    : 5	(signed)
    <3d>   DW_AT_name        : (indirect string, offset: 0x128): long long int
 <1><41>: Abbrev Number: 4 (DW_TAG_typedef)
    <42>   DW_AT_name        : u8
    <45>   DW_AT_decl_file   : 2
    <46>   DW_AT_decl_line   : 10
    <47>   DW_AT_decl_column : 28
    <48>   DW_AT_type        : <0x4c>
 <1><4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 1
    <4e>   DW_AT_encoding    : 8	(unsigned char)
    <4f>   DW_AT_name        : (indirect string, offset: 0x1e6): unsigned char
 <1><53>: Abbrev Number: 4 (DW_TAG_typedef)
    <54>   DW_AT_name        : u16
    <58>   DW_AT_decl_file   : 2
    <59>   DW_AT_decl_line   : 11
    <5a>   DW_AT_decl_column : 28
    <5b>   DW_AT_type        : <0x5f>
 <1><5f>: Abbrev Number: 2 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 7	(unsigned)
    <62>   DW_AT_name        : (indirect string, offset: 0x286): short unsigned int
 <1><66>: Abbrev Number: 4 (DW_TAG_typedef)
    <67>   DW_AT_name        : u32
    <6b>   DW_AT_decl_file   : 2
    <6c>   DW_AT_decl_line   : 12
    <6d>   DW_AT_decl_column : 28
    <6e>   DW_AT_type        : <0x72>
 <1><72>: Abbrev Number: 2 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 4
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0x205): unsigned int
 <1><79>: Abbrev Number: 2 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 8
    <7b>   DW_AT_encoding    : 7	(unsigned)
    <7c>   DW_AT_name        : (indirect string, offset: 0x1fb): long long unsigned int
 <1><80>: Abbrev Number: 2 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 4
    <82>   DW_AT_encoding    : 4	(float)
    <83>   DW_AT_name        : (indirect string, offset: 0x114): float
 <1><87>: Abbrev Number: 2 (DW_TAG_base_type)
    <88>   DW_AT_byte_size   : 8
    <89>   DW_AT_encoding    : 4	(float)
    <8a>   DW_AT_name        : (indirect string, offset: 0x3a4): double
 <1><8e>: Abbrev Number: 5 (DW_TAG_structure_type)
    <8f>   DW_AT_name        : (indirect string, offset: 0x158): vmem_page
    <93>   DW_AT_byte_size   : 4
    <94>   DW_AT_decl_file   : 3
    <95>   DW_AT_decl_line   : 20
    <96>   DW_AT_decl_column : 16
    <97>   DW_AT_sibling     : <0x15c>
 <2><9b>: Abbrev Number: 6 (DW_TAG_member)
    <9c>   DW_AT_name        : (indirect string, offset: 0x917): present
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 21
    <a2>   DW_AT_decl_column : 9
    <a3>   DW_AT_type        : <0x66>
    <a7>   DW_AT_byte_size   : 4
    <a8>   DW_AT_bit_size    : 1
    <a9>   DW_AT_bit_offset  : 31
    <aa>   DW_AT_data_member_location: 0
 <2><ab>: Abbrev Number: 6 (DW_TAG_member)
    <ac>   DW_AT_name        : (indirect string, offset: 0x0): writable
    <b0>   DW_AT_decl_file   : 3
    <b1>   DW_AT_decl_line   : 22
    <b2>   DW_AT_decl_column : 9
    <b3>   DW_AT_type        : <0x66>
    <b7>   DW_AT_byte_size   : 4
    <b8>   DW_AT_bit_size    : 1
    <b9>   DW_AT_bit_offset  : 30
    <ba>   DW_AT_data_member_location: 0
 <2><bb>: Abbrev Number: 6 (DW_TAG_member)
    <bc>   DW_AT_name        : (indirect string, offset: 0x281): user
    <c0>   DW_AT_decl_file   : 3
    <c1>   DW_AT_decl_line   : 23
    <c2>   DW_AT_decl_column : 9
    <c3>   DW_AT_type        : <0x66>
    <c7>   DW_AT_byte_size   : 4
    <c8>   DW_AT_bit_size    : 1
    <c9>   DW_AT_bit_offset  : 29
    <ca>   DW_AT_data_member_location: 0
 <2><cb>: Abbrev Number: 7 (DW_TAG_member)
    <cc>   DW_AT_name        : pwt
    <d0>   DW_AT_decl_file   : 3
    <d1>   DW_AT_decl_line   : 24
    <d2>   DW_AT_decl_column : 9
    <d3>   DW_AT_type        : <0x66>
    <d7>   DW_AT_byte_size   : 4
    <d8>   DW_AT_bit_size    : 1
    <d9>   DW_AT_bit_offset  : 28
    <da>   DW_AT_data_member_location: 0
 <2><db>: Abbrev Number: 7 (DW_TAG_member)
    <dc>   DW_AT_name        : pcd
    <e0>   DW_AT_decl_file   : 3
    <e1>   DW_AT_decl_line   : 25
    <e2>   DW_AT_decl_column : 9
    <e3>   DW_AT_type        : <0x66>
    <e7>   DW_AT_byte_size   : 4
    <e8>   DW_AT_bit_size    : 1
    <e9>   DW_AT_bit_offset  : 27
    <ea>   DW_AT_data_member_location: 0
 <2><eb>: Abbrev Number: 6 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0xab): accessed
    <f0>   DW_AT_decl_file   : 3
    <f1>   DW_AT_decl_line   : 26
    <f2>   DW_AT_decl_column : 9
    <f3>   DW_AT_type        : <0x66>
    <f7>   DW_AT_byte_size   : 4
    <f8>   DW_AT_bit_size    : 1
    <f9>   DW_AT_bit_offset  : 26
    <fa>   DW_AT_data_member_location: 0
 <2><fb>: Abbrev Number: 6 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x233): dirty
    <100>   DW_AT_decl_file   : 3
    <101>   DW_AT_decl_line   : 27
    <102>   DW_AT_decl_column : 9
    <103>   DW_AT_type        : <0x66>
    <107>   DW_AT_byte_size   : 4
    <108>   DW_AT_bit_size    : 1
    <109>   DW_AT_bit_offset  : 25
    <10a>   DW_AT_data_member_location: 0
 <2><10b>: Abbrev Number: 6 (DW_TAG_member)
    <10c>   DW_AT_name        : (indirect string, offset: 0x2a8): four_mb
    <110>   DW_AT_decl_file   : 3
    <111>   DW_AT_decl_line   : 28
    <112>   DW_AT_decl_column : 9
    <113>   DW_AT_type        : <0x66>
    <117>   DW_AT_byte_size   : 4
    <118>   DW_AT_bit_size    : 1
    <119>   DW_AT_bit_offset  : 24
    <11a>   DW_AT_data_member_location: 0
 <2><11b>: Abbrev Number: 6 (DW_TAG_member)
    <11c>   DW_AT_name        : (indirect string, offset: 0x2df): cpu_global
    <120>   DW_AT_decl_file   : 3
    <121>   DW_AT_decl_line   : 29
    <122>   DW_AT_decl_column : 9
    <123>   DW_AT_type        : <0x66>
    <127>   DW_AT_byte_size   : 4
    <128>   DW_AT_bit_size    : 1
    <129>   DW_AT_bit_offset  : 23
    <12a>   DW_AT_data_member_location: 0
 <2><12b>: Abbrev Number: 6 (DW_TAG_member)
    <12c>   DW_AT_name        : (indirect string, offset: 0x2ba): lv4_global
    <130>   DW_AT_decl_file   : 3
    <131>   DW_AT_decl_line   : 30
    <132>   DW_AT_decl_column : 9
    <133>   DW_AT_type        : <0x66>
    <137>   DW_AT_byte_size   : 4
    <138>   DW_AT_bit_size    : 1
    <139>   DW_AT_bit_offset  : 22
    <13a>   DW_AT_data_member_location: 0
 <2><13b>: Abbrev Number: 6 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0x43d): reserved
    <140>   DW_AT_decl_file   : 3
    <141>   DW_AT_decl_line   : 31
    <142>   DW_AT_decl_column : 9
    <143>   DW_AT_type        : <0x66>
    <147>   DW_AT_byte_size   : 4
    <148>   DW_AT_bit_size    : 2
    <149>   DW_AT_bit_offset  : 20
    <14a>   DW_AT_data_member_location: 0
 <2><14b>: Abbrev Number: 6 (DW_TAG_member)
    <14c>   DW_AT_name        : (indirect string, offset: 0x1ae): frame
    <150>   DW_AT_decl_file   : 3
    <151>   DW_AT_decl_line   : 32
    <152>   DW_AT_decl_column : 9
    <153>   DW_AT_type        : <0x66>
    <157>   DW_AT_byte_size   : 4
    <158>   DW_AT_bit_size    : 20
    <159>   DW_AT_bit_offset  : 0
    <15a>   DW_AT_data_member_location: 0
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 8 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x158): vmem_page
    <161>   DW_AT_decl_file   : 3
    <162>   DW_AT_decl_line   : 33
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x8e>
 <1><168>: Abbrev Number: 5 (DW_TAG_structure_type)
    <169>   DW_AT_name        : (indirect string, offset: 0x52): vmem_table_entry
    <16d>   DW_AT_byte_size   : 4
    <16e>   DW_AT_decl_file   : 3
    <16f>   DW_AT_decl_line   : 35
    <170>   DW_AT_decl_column : 16
    <171>   DW_AT_sibling     : <0x226>
 <2><175>: Abbrev Number: 6 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x917): present
    <17a>   DW_AT_decl_file   : 3
    <17b>   DW_AT_decl_line   : 36
    <17c>   DW_AT_decl_column : 9
    <17d>   DW_AT_type        : <0x66>
    <181>   DW_AT_byte_size   : 4
    <182>   DW_AT_bit_size    : 1
    <183>   DW_AT_bit_offset  : 31
    <184>   DW_AT_data_member_location: 0
 <2><185>: Abbrev Number: 6 (DW_TAG_member)
    <186>   DW_AT_name        : (indirect string, offset: 0x0): writable
    <18a>   DW_AT_decl_file   : 3
    <18b>   DW_AT_decl_line   : 37
    <18c>   DW_AT_decl_column : 9
    <18d>   DW_AT_type        : <0x66>
    <191>   DW_AT_byte_size   : 4
    <192>   DW_AT_bit_size    : 1
    <193>   DW_AT_bit_offset  : 30
    <194>   DW_AT_data_member_location: 0
 <2><195>: Abbrev Number: 6 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x281): user
    <19a>   DW_AT_decl_file   : 3
    <19b>   DW_AT_decl_line   : 38
    <19c>   DW_AT_decl_column : 9
    <19d>   DW_AT_type        : <0x66>
    <1a1>   DW_AT_byte_size   : 4
    <1a2>   DW_AT_bit_size    : 1
    <1a3>   DW_AT_bit_offset  : 29
    <1a4>   DW_AT_data_member_location: 0
 <2><1a5>: Abbrev Number: 7 (DW_TAG_member)
    <1a6>   DW_AT_name        : pwt
    <1aa>   DW_AT_decl_file   : 3
    <1ab>   DW_AT_decl_line   : 39
    <1ac>   DW_AT_decl_column : 9
    <1ad>   DW_AT_type        : <0x66>
    <1b1>   DW_AT_byte_size   : 4
    <1b2>   DW_AT_bit_size    : 1
    <1b3>   DW_AT_bit_offset  : 28
    <1b4>   DW_AT_data_member_location: 0
 <2><1b5>: Abbrev Number: 7 (DW_TAG_member)
    <1b6>   DW_AT_name        : pcd
    <1ba>   DW_AT_decl_file   : 3
    <1bb>   DW_AT_decl_line   : 40
    <1bc>   DW_AT_decl_column : 9
    <1bd>   DW_AT_type        : <0x66>
    <1c1>   DW_AT_byte_size   : 4
    <1c2>   DW_AT_bit_size    : 1
    <1c3>   DW_AT_bit_offset  : 27
    <1c4>   DW_AT_data_member_location: 0
 <2><1c5>: Abbrev Number: 6 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0xab): accessed
    <1ca>   DW_AT_decl_file   : 3
    <1cb>   DW_AT_decl_line   : 41
    <1cc>   DW_AT_decl_column : 9
    <1cd>   DW_AT_type        : <0x66>
    <1d1>   DW_AT_byte_size   : 4
    <1d2>   DW_AT_bit_size    : 1
    <1d3>   DW_AT_bit_offset  : 26
    <1d4>   DW_AT_data_member_location: 0
 <2><1d5>: Abbrev Number: 6 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x3ec): intelresv
    <1da>   DW_AT_decl_file   : 3
    <1db>   DW_AT_decl_line   : 42
    <1dc>   DW_AT_decl_column : 9
    <1dd>   DW_AT_type        : <0x66>
    <1e1>   DW_AT_byte_size   : 4
    <1e2>   DW_AT_bit_size    : 1
    <1e3>   DW_AT_bit_offset  : 25
    <1e4>   DW_AT_data_member_location: 0
 <2><1e5>: Abbrev Number: 6 (DW_TAG_member)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x2a8): four_mb
    <1ea>   DW_AT_decl_file   : 3
    <1eb>   DW_AT_decl_line   : 43
    <1ec>   DW_AT_decl_column : 9
    <1ed>   DW_AT_type        : <0x66>
    <1f1>   DW_AT_byte_size   : 4
    <1f2>   DW_AT_bit_size    : 1
    <1f3>   DW_AT_bit_offset  : 24
    <1f4>   DW_AT_data_member_location: 0
 <2><1f5>: Abbrev Number: 6 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x2be): global
    <1fa>   DW_AT_decl_file   : 3
    <1fb>   DW_AT_decl_line   : 44
    <1fc>   DW_AT_decl_column : 9
    <1fd>   DW_AT_type        : <0x66>
    <201>   DW_AT_byte_size   : 4
    <202>   DW_AT_bit_size    : 1
    <203>   DW_AT_bit_offset  : 23
    <204>   DW_AT_data_member_location: 0
 <2><205>: Abbrev Number: 6 (DW_TAG_member)
    <206>   DW_AT_name        : (indirect string, offset: 0x43d): reserved
    <20a>   DW_AT_decl_file   : 3
    <20b>   DW_AT_decl_line   : 45
    <20c>   DW_AT_decl_column : 9
    <20d>   DW_AT_type        : <0x66>
    <211>   DW_AT_byte_size   : 4
    <212>   DW_AT_bit_size    : 3
    <213>   DW_AT_bit_offset  : 20
    <214>   DW_AT_data_member_location: 0
 <2><215>: Abbrev Number: 6 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x1ae): frame
    <21a>   DW_AT_decl_file   : 3
    <21b>   DW_AT_decl_line   : 46
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0x66>
    <221>   DW_AT_byte_size   : 4
    <222>   DW_AT_bit_size    : 20
    <223>   DW_AT_bit_offset  : 0
    <224>   DW_AT_data_member_location: 0
 <2><225>: Abbrev Number: 0
 <1><226>: Abbrev Number: 8 (DW_TAG_typedef)
    <227>   DW_AT_name        : (indirect string, offset: 0x52): vmem_table_entry
    <22b>   DW_AT_decl_file   : 3
    <22c>   DW_AT_decl_line   : 47
    <22d>   DW_AT_decl_column : 3
    <22e>   DW_AT_type        : <0x168>
 <1><232>: Abbrev Number: 9 (DW_TAG_structure_type)
    <233>   DW_AT_name        : (indirect string, offset: 0x3f6): vmem_table
    <237>   DW_AT_byte_size   : 4096
    <239>   DW_AT_decl_file   : 3
    <23a>   DW_AT_decl_line   : 49
    <23b>   DW_AT_decl_column : 16
    <23c>   DW_AT_sibling     : <0x24e>
 <2><240>: Abbrev Number: 10 (DW_TAG_member)
    <241>   DW_AT_name        : (indirect string, offset: 0x1b9): pages
    <245>   DW_AT_decl_file   : 3
    <246>   DW_AT_decl_line   : 50
    <247>   DW_AT_decl_column : 15
    <248>   DW_AT_type        : <0x24e>
    <24c>   DW_AT_data_member_location: 0
 <2><24d>: Abbrev Number: 0
 <1><24e>: Abbrev Number: 11 (DW_TAG_array_type)
    <24f>   DW_AT_type        : <0x15c>
    <253>   DW_AT_sibling     : <0x25f>
 <2><257>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <258>   DW_AT_type        : <0x72>
    <25c>   DW_AT_upper_bound : 1023
 <2><25e>: Abbrev Number: 0
 <1><25f>: Abbrev Number: 8 (DW_TAG_typedef)
    <260>   DW_AT_name        : (indirect string, offset: 0x3f6): vmem_table
    <264>   DW_AT_decl_file   : 3
    <265>   DW_AT_decl_line   : 51
    <266>   DW_AT_decl_column : 3
    <267>   DW_AT_type        : <0x232>
 <1><26b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <26c>   DW_AT_name        : (indirect string, offset: 0x29): vmem
    <270>   DW_AT_byte_size   : 4096
    <272>   DW_AT_decl_file   : 3
    <273>   DW_AT_decl_line   : 53
    <274>   DW_AT_decl_column : 16
    <275>   DW_AT_sibling     : <0x287>
 <2><279>: Abbrev Number: 10 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0x146): tables
    <27e>   DW_AT_decl_file   : 3
    <27f>   DW_AT_decl_line   : 54
    <280>   DW_AT_decl_column : 22
    <281>   DW_AT_type        : <0x287>
    <285>   DW_AT_data_member_location: 0
 <2><286>: Abbrev Number: 0
 <1><287>: Abbrev Number: 11 (DW_TAG_array_type)
    <288>   DW_AT_type        : <0x226>
    <28c>   DW_AT_sibling     : <0x298>
 <2><290>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <291>   DW_AT_type        : <0x72>
    <295>   DW_AT_upper_bound : 1023
 <2><297>: Abbrev Number: 0
 <1><298>: Abbrev Number: 8 (DW_TAG_typedef)
    <299>   DW_AT_name        : (indirect string, offset: 0x29): vmem
    <29d>   DW_AT_decl_file   : 3
    <29e>   DW_AT_decl_line   : 55
    <29f>   DW_AT_decl_column : 3
    <2a0>   DW_AT_type        : <0x26b>
 <1><2a4>: Abbrev Number: 13 (DW_TAG_variable)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x239): kernel_memory
    <2a9>   DW_AT_decl_file   : 3
    <2aa>   DW_AT_decl_line   : 57
    <2ab>   DW_AT_decl_column : 14
    <2ac>   DW_AT_type        : <0x2b0>
    <2b0>   DW_AT_external    : 1
    <2b0>   DW_AT_declaration : 1
 <1><2b0>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <2b1>   DW_AT_byte_size   : 4
    <2b2>   DW_AT_type        : <0x298>
 <1><2b6>: Abbrev Number: 15 (DW_TAG_structure_type)
    <2b7>   DW_AT_name        : fd
    <2ba>   DW_AT_byte_size   : 24
    <2bb>   DW_AT_decl_file   : 4
    <2bc>   DW_AT_decl_line   : 19
    <2bd>   DW_AT_decl_column : 16
    <2be>   DW_AT_sibling     : <0x311>
 <2><2c2>: Abbrev Number: 10 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x437): magic
    <2c7>   DW_AT_decl_file   : 4
    <2c8>   DW_AT_decl_line   : 20
    <2c9>   DW_AT_decl_column : 9
    <2ca>   DW_AT_type        : <0x66>
    <2ce>   DW_AT_data_member_location: 0
 <2><2cf>: Abbrev Number: 10 (DW_TAG_member)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x984): type
    <2d4>   DW_AT_decl_file   : 4
    <2d5>   DW_AT_decl_line   : 21
    <2d6>   DW_AT_decl_column : 8
    <2d7>   DW_AT_type        : <0x41>
    <2db>   DW_AT_data_member_location: 4
 <2><2dc>: Abbrev Number: 10 (DW_TAG_member)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x2f7): buffer
    <2e1>   DW_AT_decl_file   : 4
    <2e2>   DW_AT_decl_line   : 23
    <2e3>   DW_AT_decl_column : 11
    <2e4>   DW_AT_type        : <0x311>
    <2e8>   DW_AT_data_member_location: 8
 <2><2e9>: Abbrev Number: 10 (DW_TAG_member)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x212): buffer_size
    <2ee>   DW_AT_decl_file   : 4
    <2ef>   DW_AT_decl_line   : 24
    <2f0>   DW_AT_decl_column : 11
    <2f1>   DW_AT_type        : <0x66>
    <2f5>   DW_AT_data_member_location: 12
 <2><2f6>: Abbrev Number: 10 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0x3c): pipe
    <2fb>   DW_AT_decl_file   : 4
    <2fc>   DW_AT_decl_line   : 26
    <2fd>   DW_AT_decl_column : 16
    <2fe>   DW_AT_type        : <0x317>
    <302>   DW_AT_data_member_location: 16
 <2><303>: Abbrev Number: 10 (DW_TAG_member)
    <304>   DW_AT_name        : (indirect string, offset: 0x1f4): cursor
    <308>   DW_AT_decl_file   : 4
    <309>   DW_AT_decl_line   : 28
    <30a>   DW_AT_decl_column : 8
    <30b>   DW_AT_type        : <0x41>
    <30f>   DW_AT_data_member_location: 20
 <2><310>: Abbrev Number: 0
 <1><311>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <312>   DW_AT_byte_size   : 4
    <313>   DW_AT_type        : <0x25>
 <1><317>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <318>   DW_AT_byte_size   : 4
    <319>   DW_AT_type        : <0x2b6>
 <1><31d>: Abbrev Number: 4 (DW_TAG_typedef)
    <31e>   DW_AT_name        : fd
    <321>   DW_AT_decl_file   : 4
    <322>   DW_AT_decl_line   : 29
    <323>   DW_AT_decl_column : 3
    <324>   DW_AT_type        : <0x2b6>
 <1><328>: Abbrev Number: 13 (DW_TAG_variable)
    <329>   DW_AT_name        : (indirect string, offset: 0x63): void_stream
    <32d>   DW_AT_decl_file   : 4
    <32e>   DW_AT_decl_line   : 31
    <32f>   DW_AT_decl_column : 12
    <330>   DW_AT_type        : <0x334>
    <334>   DW_AT_external    : 1
    <334>   DW_AT_declaration : 1
 <1><334>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <335>   DW_AT_byte_size   : 4
    <336>   DW_AT_type        : <0x31d>
 <1><33a>: Abbrev Number: 13 (DW_TAG_variable)
    <33b>   DW_AT_name        : (indirect string, offset: 0x83): cursor_y
    <33f>   DW_AT_decl_file   : 5
    <340>   DW_AT_decl_line   : 29
    <341>   DW_AT_decl_column : 11
    <342>   DW_AT_type        : <0x41>
    <346>   DW_AT_external    : 1
    <346>   DW_AT_declaration : 1
 <1><346>: Abbrev Number: 16 (DW_TAG_variable)
    <347>   DW_AT_name        : (indirect string, offset: 0x25e): vmem_bitmap
    <34b>   DW_AT_decl_file   : 1
    <34c>   DW_AT_decl_line   : 6
    <34d>   DW_AT_decl_column : 5
    <34e>   DW_AT_type        : <0x358>
    <352>   DW_AT_external    : 1
    <352>   DW_AT_location    : 5 byte block: 3 a8 f1 12 0 	(DW_OP_addr: 12f1a8)
 <1><358>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <359>   DW_AT_byte_size   : 4
    <35a>   DW_AT_type        : <0x41>
 <1><35e>: Abbrev Number: 16 (DW_TAG_variable)
    <35f>   DW_AT_name        : (indirect string, offset: 0x18b): vmem_bitmapCount
    <363>   DW_AT_decl_file   : 1
    <364>   DW_AT_decl_line   : 7
    <365>   DW_AT_decl_column : 5
    <366>   DW_AT_type        : <0x66>
    <36a>   DW_AT_external    : 1
    <36a>   DW_AT_location    : 5 byte block: 3 ac f1 12 0 	(DW_OP_addr: 12f1ac)
 <1><370>: Abbrev Number: 16 (DW_TAG_variable)
    <371>   DW_AT_name        : (indirect string, offset: 0x21): current_vmem
    <375>   DW_AT_decl_file   : 1
    <376>   DW_AT_decl_line   : 9
    <377>   DW_AT_decl_column : 7
    <378>   DW_AT_type        : <0x2b0>
    <37c>   DW_AT_external    : 1
    <37c>   DW_AT_location    : 5 byte block: 3 b0 f1 12 0 	(DW_OP_addr: 12f1b0)
 <1><382>: Abbrev Number: 17 (DW_TAG_variable)
    <383>   DW_AT_specification: <0x2a4>
    <387>   DW_AT_decl_file   : 1
    <388>   DW_AT_decl_line   : 10
    <389>   DW_AT_decl_column : 7
    <38a>   DW_AT_location    : 5 byte block: 3 b4 f1 12 0 	(DW_OP_addr: 12f1b4)
 <1><390>: Abbrev Number: 18 (DW_TAG_subprogram)
    <391>   DW_AT_external    : 1
    <391>   DW_AT_name        : (indirect string, offset: 0x2b0): vmem_init
    <395>   DW_AT_decl_file   : 1
    <396>   DW_AT_decl_line   : 271
    <398>   DW_AT_decl_column : 6
    <399>   DW_AT_low_pc      : 0x10564f
    <39d>   DW_AT_high_pc     : 0x75
    <3a1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3a3>   DW_AT_GNU_all_tail_call_sites: 1
    <3a3>   DW_AT_sibling     : <0x3c0>
 <2><3a7>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <3a8>   DW_AT_low_pc      : 0x105673
    <3ac>   DW_AT_high_pc     : 0x38
 <3><3b0>: Abbrev Number: 20 (DW_TAG_variable)
    <3b1>   DW_AT_name        : i
    <3b3>   DW_AT_decl_file   : 1
    <3b4>   DW_AT_decl_line   : 276
    <3b6>   DW_AT_decl_column : 14
    <3b7>   DW_AT_type        : <0x66>
    <3bb>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><3be>: Abbrev Number: 0
 <2><3bf>: Abbrev Number: 0
 <1><3c0>: Abbrev Number: 21 (DW_TAG_subprogram)
    <3c1>   DW_AT_external    : 1
    <3c1>   DW_AT_name        : (indirect string, offset: 0x227): vmem_enable
    <3c5>   DW_AT_decl_file   : 1
    <3c6>   DW_AT_decl_line   : 264
    <3c8>   DW_AT_decl_column : 6
    <3c9>   DW_AT_low_pc      : 0x10562f
    <3cd>   DW_AT_high_pc     : 0x20
    <3d1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3d3>   DW_AT_GNU_all_call_sites: 1
    <3d3>   DW_AT_sibling     : <0x3e8>
 <2><3d7>: Abbrev Number: 20 (DW_TAG_variable)
    <3d8>   DW_AT_name        : cr0
    <3dc>   DW_AT_decl_file   : 1
    <3dd>   DW_AT_decl_line   : 265
    <3df>   DW_AT_decl_column : 9
    <3e0>   DW_AT_type        : <0x66>
    <3e4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><3e7>: Abbrev Number: 0
 <1><3e8>: Abbrev Number: 22 (DW_TAG_subprogram)
    <3e9>   DW_AT_external    : 1
    <3e9>   DW_AT_name        : (indirect string, offset: 0x3bb): vmem_switchMemory
    <3ed>   DW_AT_decl_file   : 1
    <3ee>   DW_AT_decl_line   : 259
    <3f0>   DW_AT_decl_column : 6
    <3f1>   DW_AT_prototyped  : 1
    <3f1>   DW_AT_low_pc      : 0x105617
    <3f5>   DW_AT_high_pc     : 0x18
    <3f9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3fb>   DW_AT_GNU_all_call_sites: 1
    <3fb>   DW_AT_sibling     : <0x410>
 <2><3ff>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <400>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <404>   DW_AT_decl_file   : 1
    <405>   DW_AT_decl_line   : 259
    <407>   DW_AT_decl_column : 30
    <408>   DW_AT_type        : <0x2b0>
    <40c>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 24 (DW_TAG_subprogram)
    <411>   DW_AT_external    : 1
    <411>   DW_AT_name        : (indirect string, offset: 0xf6): vmem_freeMemory
    <415>   DW_AT_decl_file   : 1
    <416>   DW_AT_decl_line   : 228
    <417>   DW_AT_decl_column : 6
    <418>   DW_AT_prototyped  : 1
    <418>   DW_AT_low_pc      : 0x1054d2
    <41c>   DW_AT_high_pc     : 0x145
    <420>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <422>   DW_AT_GNU_all_tail_call_sites: 1
    <422>   DW_AT_sibling     : <0x4cf>
 <2><426>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <427>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <42b>   DW_AT_decl_file   : 1
    <42c>   DW_AT_decl_line   : 228
    <42d>   DW_AT_decl_column : 28
    <42e>   DW_AT_type        : <0x2b0>
    <432>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><435>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <436>   DW_AT_low_pc      : 0x1054e7
    <43a>   DW_AT_high_pc     : 0xd2
    <43e>   DW_AT_sibling     : <0x4b7>
 <3><442>: Abbrev Number: 27 (DW_TAG_variable)
    <443>   DW_AT_name        : p
    <445>   DW_AT_decl_file   : 1
    <446>   DW_AT_decl_line   : 231
    <447>   DW_AT_decl_column : 14
    <448>   DW_AT_type        : <0x66>
    <44c>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><44f>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <450>   DW_AT_low_pc      : 0x1054f3
    <454>   DW_AT_high_pc     : 0xb5
 <4><458>: Abbrev Number: 28 (DW_TAG_variable)
    <459>   DW_AT_name        : (indirect string, offset: 0x2cf): page
    <45d>   DW_AT_decl_file   : 1
    <45e>   DW_AT_decl_line   : 232
    <45f>   DW_AT_decl_column : 13
    <460>   DW_AT_type        : <0x53>
    <464>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <4><467>: Abbrev Number: 28 (DW_TAG_variable)
    <468>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <46c>   DW_AT_decl_file   : 1
    <46d>   DW_AT_decl_line   : 233
    <46e>   DW_AT_decl_column : 13
    <46f>   DW_AT_type        : <0x53>
    <473>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <4><476>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <477>   DW_AT_low_pc      : 0x10552b
    <47b>   DW_AT_high_pc     : 0x7d
 <5><47f>: Abbrev Number: 27 (DW_TAG_variable)
    <480>   DW_AT_name        : t
    <482>   DW_AT_decl_file   : 1
    <483>   DW_AT_decl_line   : 239
    <484>   DW_AT_decl_column : 25
    <485>   DW_AT_type        : <0x4cf>
    <489>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <5><48c>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <48d>   DW_AT_low_pc      : 0x10555b
    <491>   DW_AT_high_pc     : 0x4c
 <6><495>: Abbrev Number: 28 (DW_TAG_variable)
    <496>   DW_AT_name        : (indirect string, offset: 0x1d1): byte
    <49a>   DW_AT_decl_file   : 1
    <49b>   DW_AT_decl_line   : 243
    <49c>   DW_AT_decl_column : 21
    <49d>   DW_AT_type        : <0x66>
    <4a1>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <6><4a4>: Abbrev Number: 27 (DW_TAG_variable)
    <4a5>   DW_AT_name        : bit
    <4a9>   DW_AT_decl_file   : 1
    <4aa>   DW_AT_decl_line   : 244
    <4ab>   DW_AT_decl_column : 21
    <4ac>   DW_AT_type        : <0x66>
    <4b0>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <6><4b3>: Abbrev Number: 0
 <5><4b4>: Abbrev Number: 0
 <4><4b5>: Abbrev Number: 0
 <3><4b6>: Abbrev Number: 0
 <2><4b7>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <4b8>   DW_AT_low_pc      : 0x1055b9
    <4bc>   DW_AT_high_pc     : 0x48
 <3><4c0>: Abbrev Number: 27 (DW_TAG_variable)
    <4c1>   DW_AT_name        : i
    <4c3>   DW_AT_decl_file   : 1
    <4c4>   DW_AT_decl_line   : 251
    <4c5>   DW_AT_decl_column : 14
    <4c6>   DW_AT_type        : <0x33>
    <4ca>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><4cd>: Abbrev Number: 0
 <2><4ce>: Abbrev Number: 0
 <1><4cf>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <4d0>   DW_AT_byte_size   : 4
    <4d1>   DW_AT_type        : <0x25f>
 <1><4d5>: Abbrev Number: 29 (DW_TAG_subprogram)
    <4d6>   DW_AT_external    : 1
    <4d6>   DW_AT_name        : (indirect string, offset: 0x8c): vmem_createTaskMemory
    <4da>   DW_AT_decl_file   : 1
    <4db>   DW_AT_decl_line   : 207
    <4dc>   DW_AT_decl_column : 7
    <4dd>   DW_AT_prototyped  : 1
    <4dd>   DW_AT_type        : <0x2b0>
    <4e1>   DW_AT_low_pc      : 0x1053ec
    <4e5>   DW_AT_high_pc     : 0xe6
    <4e9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4eb>   DW_AT_GNU_all_tail_call_sites: 1
    <4eb>   DW_AT_sibling     : <0x58b>
 <2><4ef>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x3d2): code_size
    <4f4>   DW_AT_decl_file   : 1
    <4f5>   DW_AT_decl_line   : 207
    <4f6>   DW_AT_decl_column : 33
    <4f7>   DW_AT_type        : <0x66>
    <4fb>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><4fe>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <4ff>   DW_AT_name        : (indirect string, offset: 0x14d): stack_size
    <503>   DW_AT_decl_file   : 1
    <504>   DW_AT_decl_line   : 207
    <505>   DW_AT_decl_column : 48
    <506>   DW_AT_type        : <0x66>
    <50a>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><50d>: Abbrev Number: 28 (DW_TAG_variable)
    <50e>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <512>   DW_AT_decl_file   : 1
    <513>   DW_AT_decl_line   : 210
    <514>   DW_AT_decl_column : 11
    <515>   DW_AT_type        : <0x2b0>
    <519>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><51c>: Abbrev Number: 28 (DW_TAG_variable)
    <51d>   DW_AT_name        : (indirect string, offset: 0x1b4): code_pages
    <521>   DW_AT_decl_file   : 1
    <522>   DW_AT_decl_line   : 213
    <523>   DW_AT_decl_column : 9
    <524>   DW_AT_type        : <0x66>
    <528>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><52b>: Abbrev Number: 28 (DW_TAG_variable)
    <52c>   DW_AT_name        : (indirect string, offset: 0x446): stack_pages
    <530>   DW_AT_decl_file   : 1
    <531>   DW_AT_decl_line   : 214
    <532>   DW_AT_decl_column : 9
    <533>   DW_AT_type        : <0x66>
    <537>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><53a>: Abbrev Number: 28 (DW_TAG_variable)
    <53b>   DW_AT_name        : (indirect string, offset: 0x2c5): code_base_page
    <53f>   DW_AT_decl_file   : 1
    <540>   DW_AT_decl_line   : 216
    <541>   DW_AT_decl_column : 9
    <542>   DW_AT_type        : <0x66>
    <546>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><549>: Abbrev Number: 28 (DW_TAG_variable)
    <54a>   DW_AT_name        : (indirect string, offset: 0x411): stack_base_page
    <54e>   DW_AT_decl_file   : 1
    <54f>   DW_AT_decl_line   : 217
    <550>   DW_AT_decl_column : 9
    <551>   DW_AT_type        : <0x66>
    <555>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><558>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <559>   DW_AT_low_pc      : 0x105469
    <55d>   DW_AT_high_pc     : 0x31
    <561>   DW_AT_sibling     : <0x573>
 <3><565>: Abbrev Number: 27 (DW_TAG_variable)
    <566>   DW_AT_name        : i
    <568>   DW_AT_decl_file   : 1
    <569>   DW_AT_decl_line   : 219
    <56a>   DW_AT_decl_column : 14
    <56b>   DW_AT_type        : <0x33>
    <56f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><572>: Abbrev Number: 0
 <2><573>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <574>   DW_AT_low_pc      : 0x10549a
    <578>   DW_AT_high_pc     : 0x33
 <3><57c>: Abbrev Number: 27 (DW_TAG_variable)
    <57d>   DW_AT_name        : i
    <57f>   DW_AT_decl_file   : 1
    <580>   DW_AT_decl_line   : 222
    <581>   DW_AT_decl_column : 14
    <582>   DW_AT_type        : <0x33>
    <586>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><589>: Abbrev Number: 0
 <2><58a>: Abbrev Number: 0
 <1><58b>: Abbrev Number: 30 (DW_TAG_subprogram)
    <58c>   DW_AT_external    : 1
    <58c>   DW_AT_name        : (indirect string, offset: 0x247): vmem_cloneKernelMemory
    <590>   DW_AT_decl_file   : 1
    <591>   DW_AT_decl_line   : 197
    <592>   DW_AT_decl_column : 7
    <593>   DW_AT_type        : <0x2b0>
    <597>   DW_AT_low_pc      : 0x105399
    <59b>   DW_AT_high_pc     : 0x53
    <59f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5a1>   DW_AT_GNU_all_tail_call_sites: 1
    <5a1>   DW_AT_sibling     : <0x5b5>
 <2><5a5>: Abbrev Number: 28 (DW_TAG_variable)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <5aa>   DW_AT_decl_file   : 1
    <5ab>   DW_AT_decl_line   : 199
    <5ac>   DW_AT_decl_column : 11
    <5ad>   DW_AT_type        : <0x2b0>
    <5b1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5b4>: Abbrev Number: 0
 <1><5b5>: Abbrev Number: 29 (DW_TAG_subprogram)
    <5b6>   DW_AT_external    : 1
    <5b6>   DW_AT_name        : (indirect string, offset: 0x26a): vmem_cloneMemoryDirect
    <5ba>   DW_AT_decl_file   : 1
    <5bb>   DW_AT_decl_line   : 190
    <5bc>   DW_AT_decl_column : 7
    <5bd>   DW_AT_prototyped  : 1
    <5bd>   DW_AT_type        : <0x2b0>
    <5c1>   DW_AT_low_pc      : 0x10536c
    <5c5>   DW_AT_high_pc     : 0x2d
    <5c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5cb>   DW_AT_GNU_all_tail_call_sites: 1
    <5cb>   DW_AT_sibling     : <0x5ee>
 <2><5cf>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <5d0>   DW_AT_name        : src
    <5d4>   DW_AT_decl_file   : 1
    <5d5>   DW_AT_decl_line   : 190
    <5d6>   DW_AT_decl_column : 36
    <5d7>   DW_AT_type        : <0x2b0>
    <5db>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><5de>: Abbrev Number: 28 (DW_TAG_variable)
    <5df>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <5e3>   DW_AT_decl_file   : 1
    <5e4>   DW_AT_decl_line   : 191
    <5e5>   DW_AT_decl_column : 11
    <5e6>   DW_AT_type        : <0x2b0>
    <5ea>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5ed>: Abbrev Number: 0
 <1><5ee>: Abbrev Number: 29 (DW_TAG_subprogram)
    <5ef>   DW_AT_external    : 1
    <5ef>   DW_AT_name        : (indirect string, offset: 0xe5): vmem_cloneMemory
    <5f3>   DW_AT_decl_file   : 1
    <5f4>   DW_AT_decl_line   : 181
    <5f5>   DW_AT_decl_column : 7
    <5f6>   DW_AT_prototyped  : 1
    <5f6>   DW_AT_type        : <0x2b0>
    <5fa>   DW_AT_low_pc      : 0x10531c
    <5fe>   DW_AT_high_pc     : 0x50
    <602>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <604>   DW_AT_GNU_all_tail_call_sites: 1
    <604>   DW_AT_sibling     : <0x63e>
 <2><608>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <609>   DW_AT_name        : src
    <60d>   DW_AT_decl_file   : 1
    <60e>   DW_AT_decl_line   : 181
    <60f>   DW_AT_decl_column : 30
    <610>   DW_AT_type        : <0x2b0>
    <614>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><617>: Abbrev Number: 28 (DW_TAG_variable)
    <618>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <61c>   DW_AT_decl_file   : 1
    <61d>   DW_AT_decl_line   : 182
    <61e>   DW_AT_decl_column : 11
    <61f>   DW_AT_type        : <0x2b0>
    <623>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><626>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <627>   DW_AT_low_pc      : 0x10532e
    <62b>   DW_AT_high_pc     : 0x39
 <3><62f>: Abbrev Number: 27 (DW_TAG_variable)
    <630>   DW_AT_name        : i
    <632>   DW_AT_decl_file   : 1
    <633>   DW_AT_decl_line   : 184
    <634>   DW_AT_decl_column : 14
    <635>   DW_AT_type        : <0x33>
    <639>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><63c>: Abbrev Number: 0
 <2><63d>: Abbrev Number: 0
 <1><63e>: Abbrev Number: 29 (DW_TAG_subprogram)
    <63f>   DW_AT_external    : 1
    <63f>   DW_AT_name        : (indirect string, offset: 0x3dc): vmem_cloneTable
    <643>   DW_AT_decl_file   : 1
    <644>   DW_AT_decl_line   : 171
    <645>   DW_AT_decl_column : 13
    <646>   DW_AT_prototyped  : 1
    <646>   DW_AT_type        : <0x4cf>
    <64a>   DW_AT_low_pc      : 0x1052bd
    <64e>   DW_AT_high_pc     : 0x5f
    <652>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <654>   DW_AT_GNU_all_tail_call_sites: 1
    <654>   DW_AT_sibling     : <0x684>
 <2><658>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <659>   DW_AT_name        : src
    <65d>   DW_AT_decl_file   : 1
    <65e>   DW_AT_decl_line   : 171
    <65f>   DW_AT_decl_column : 35
    <660>   DW_AT_type        : <0x2b0>
    <664>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><667>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <668>   DW_AT_name        : i
    <66a>   DW_AT_decl_file   : 1
    <66b>   DW_AT_decl_line   : 171
    <66c>   DW_AT_decl_column : 44
    <66d>   DW_AT_type        : <0x33>
    <671>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><674>: Abbrev Number: 28 (DW_TAG_variable)
    <675>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <679>   DW_AT_decl_file   : 1
    <67a>   DW_AT_decl_line   : 174
    <67b>   DW_AT_decl_column : 17
    <67c>   DW_AT_type        : <0x4cf>
    <680>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><683>: Abbrev Number: 0
 <1><684>: Abbrev Number: 30 (DW_TAG_subprogram)
    <685>   DW_AT_external    : 1
    <685>   DW_AT_name        : (indirect string, offset: 0xc4): vmem_createMemory
    <689>   DW_AT_decl_file   : 1
    <68a>   DW_AT_decl_line   : 163
    <68b>   DW_AT_decl_column : 7
    <68c>   DW_AT_type        : <0x2b0>
    <690>   DW_AT_low_pc      : 0x105279
    <694>   DW_AT_high_pc     : 0x44
    <698>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <69a>   DW_AT_GNU_all_tail_call_sites: 1
    <69a>   DW_AT_sibling     : <0x6ae>
 <2><69e>: Abbrev Number: 28 (DW_TAG_variable)
    <69f>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <6a3>   DW_AT_decl_file   : 1
    <6a4>   DW_AT_decl_line   : 164
    <6a5>   DW_AT_decl_column : 11
    <6a6>   DW_AT_type        : <0x2b0>
    <6aa>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6ad>: Abbrev Number: 0
 <1><6ae>: Abbrev Number: 29 (DW_TAG_subprogram)
    <6af>   DW_AT_external    : 1
    <6af>   DW_AT_name        : (indirect string, offset: 0x3ab): vmem_initBitmap
    <6b3>   DW_AT_decl_file   : 1
    <6b4>   DW_AT_decl_line   : 150
    <6b5>   DW_AT_decl_column : 4
    <6b6>   DW_AT_prototyped  : 1
    <6b6>   DW_AT_type        : <0x41>
    <6ba>   DW_AT_low_pc      : 0x10520e
    <6be>   DW_AT_high_pc     : 0x6b
    <6c2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6c4>   DW_AT_GNU_all_tail_call_sites: 1
    <6c4>   DW_AT_sibling     : <0x6f6>
 <2><6c8>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x2fe): mem_pages
    <6cd>   DW_AT_decl_file   : 1
    <6ce>   DW_AT_decl_line   : 150
    <6cf>   DW_AT_decl_column : 24
    <6d0>   DW_AT_type        : <0x66>
    <6d4>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><6d7>: Abbrev Number: 28 (DW_TAG_variable)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x2d4): user_pages
    <6dc>   DW_AT_decl_file   : 1
    <6dd>   DW_AT_decl_line   : 151
    <6de>   DW_AT_decl_column : 9
    <6df>   DW_AT_type        : <0x66>
    <6e3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6e6>: Abbrev Number: 28 (DW_TAG_variable)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x16): bitmapSize
    <6eb>   DW_AT_decl_file   : 1
    <6ec>   DW_AT_decl_line   : 154
    <6ed>   DW_AT_decl_column : 9
    <6ee>   DW_AT_type        : <0x66>
    <6f2>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><6f5>: Abbrev Number: 0
 <1><6f6>: Abbrev Number: 29 (DW_TAG_subprogram)
    <6f7>   DW_AT_external    : 1
    <6f7>   DW_AT_name        : (indirect string, offset: 0xd6): vmem_allocPage
    <6fb>   DW_AT_decl_file   : 1
    <6fc>   DW_AT_decl_line   : 141
    <6fd>   DW_AT_decl_column : 4
    <6fe>   DW_AT_prototyped  : 1
    <6fe>   DW_AT_type        : <0x41>
    <702>   DW_AT_low_pc      : 0x1051d4
    <706>   DW_AT_high_pc     : 0x3a
    <70a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <70c>   DW_AT_GNU_all_tail_call_sites: 1
    <70c>   DW_AT_sibling     : <0x74d>
 <2><710>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <711>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <715>   DW_AT_decl_file   : 1
    <716>   DW_AT_decl_line   : 141
    <717>   DW_AT_decl_column : 25
    <718>   DW_AT_type        : <0x2b0>
    <71c>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><71f>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <720>   DW_AT_name        : (indirect string, offset: 0xb4): page_addr
    <724>   DW_AT_decl_file   : 1
    <725>   DW_AT_decl_line   : 141
    <726>   DW_AT_decl_column : 37
    <727>   DW_AT_type        : <0x66>
    <72b>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><72e>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <72f>   DW_AT_name        : (indirect string, offset: 0x3cd): attr
    <733>   DW_AT_decl_file   : 1
    <734>   DW_AT_decl_line   : 141
    <735>   DW_AT_decl_column : 52
    <736>   DW_AT_type        : <0x66>
    <73a>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><73d>: Abbrev Number: 28 (DW_TAG_variable)
    <73e>   DW_AT_name        : (indirect string, offset: 0x21e): pys_addr
    <742>   DW_AT_decl_file   : 1
    <743>   DW_AT_decl_line   : 142
    <744>   DW_AT_decl_column : 9
    <745>   DW_AT_type        : <0x66>
    <749>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><74c>: Abbrev Number: 0
 <1><74d>: Abbrev Number: 32 (DW_TAG_subprogram)
    <74e>   DW_AT_external    : 1
    <74e>   DW_AT_name        : (indirect string, offset: 0x421): vmem_freeFrame
    <752>   DW_AT_decl_file   : 1
    <753>   DW_AT_decl_line   : 134
    <754>   DW_AT_decl_column : 6
    <755>   DW_AT_prototyped  : 1
    <755>   DW_AT_low_pc      : 0x10517c
    <759>   DW_AT_high_pc     : 0x58
    <75d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <75f>   DW_AT_GNU_all_call_sites: 1
    <75f>   DW_AT_sibling     : <0x782>
 <2><763>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <764>   DW_AT_name        : (indirect string, offset: 0x1ae): frame
    <768>   DW_AT_decl_file   : 1
    <769>   DW_AT_decl_line   : 134
    <76a>   DW_AT_decl_column : 25
    <76b>   DW_AT_type        : <0x66>
    <76f>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><772>: Abbrev Number: 28 (DW_TAG_variable)
    <773>   DW_AT_name        : (indirect string, offset: 0x2cf): page
    <777>   DW_AT_decl_file   : 1
    <778>   DW_AT_decl_line   : 135
    <779>   DW_AT_decl_column : 9
    <77a>   DW_AT_type        : <0x66>
    <77e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><781>: Abbrev Number: 0
 <1><782>: Abbrev Number: 33 (DW_TAG_subprogram)
    <783>   DW_AT_external    : 1
    <783>   DW_AT_name        : (indirect string, offset: 0x136): vmem_allocFrame
    <787>   DW_AT_decl_file   : 1
    <788>   DW_AT_decl_line   : 117
    <789>   DW_AT_decl_column : 5
    <78a>   DW_AT_type        : <0x66>
    <78e>   DW_AT_low_pc      : 0x1050bd
    <792>   DW_AT_high_pc     : 0xbf
    <796>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <798>   DW_AT_GNU_all_call_sites: 1
    <798>   DW_AT_sibling     : <0x7eb>
 <2><79c>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <79d>   DW_AT_low_pc      : 0x1050c8
    <7a1>   DW_AT_high_pc     : 0xa9
 <3><7a5>: Abbrev Number: 27 (DW_TAG_variable)
    <7a6>   DW_AT_name        : i
    <7a8>   DW_AT_decl_file   : 1
    <7a9>   DW_AT_decl_line   : 118
    <7aa>   DW_AT_decl_column : 14
    <7ab>   DW_AT_type        : <0x33>
    <7af>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><7b2>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <7b3>   DW_AT_low_pc      : 0x1050d4
    <7b7>   DW_AT_high_pc     : 0x89
 <4><7bb>: Abbrev Number: 28 (DW_TAG_variable)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x1d1): byte
    <7c0>   DW_AT_decl_file   : 1
    <7c1>   DW_AT_decl_line   : 119
    <7c2>   DW_AT_decl_column : 13
    <7c3>   DW_AT_type        : <0x66>
    <7c7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><7ca>: Abbrev Number: 27 (DW_TAG_variable)
    <7cb>   DW_AT_name        : bit
    <7cf>   DW_AT_decl_file   : 1
    <7d0>   DW_AT_decl_line   : 120
    <7d1>   DW_AT_decl_column : 13
    <7d2>   DW_AT_type        : <0x66>
    <7d6>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <4><7d9>: Abbrev Number: 28 (DW_TAG_variable)
    <7da>   DW_AT_name        : (indirect string, offset: 0xbe): value
    <7de>   DW_AT_decl_file   : 1
    <7df>   DW_AT_decl_line   : 122
    <7e0>   DW_AT_decl_column : 12
    <7e1>   DW_AT_type        : <0x41>
    <7e5>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <4><7e8>: Abbrev Number: 0
 <3><7e9>: Abbrev Number: 0
 <2><7ea>: Abbrev Number: 0
 <1><7eb>: Abbrev Number: 24 (DW_TAG_subprogram)
    <7ec>   DW_AT_external    : 1
    <7ec>   DW_AT_name        : (indirect string, offset: 0x11a): vmem_freePage
    <7f0>   DW_AT_decl_file   : 1
    <7f1>   DW_AT_decl_line   : 98
    <7f2>   DW_AT_decl_column : 6
    <7f3>   DW_AT_prototyped  : 1
    <7f3>   DW_AT_low_pc      : 0x10500e
    <7f7>   DW_AT_high_pc     : 0xaf
    <7fb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7fd>   DW_AT_GNU_all_tail_call_sites: 1
    <7fd>   DW_AT_sibling     : <0x872>
 <2><801>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <802>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <806>   DW_AT_decl_file   : 1
    <807>   DW_AT_decl_line   : 98
    <808>   DW_AT_decl_column : 26
    <809>   DW_AT_type        : <0x2b0>
    <80d>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><810>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <811>   DW_AT_name        : (indirect string, offset: 0xb4): page_addr
    <815>   DW_AT_decl_file   : 1
    <816>   DW_AT_decl_line   : 98
    <817>   DW_AT_decl_column : 38
    <818>   DW_AT_type        : <0x66>
    <81c>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><81f>: Abbrev Number: 28 (DW_TAG_variable)
    <820>   DW_AT_name        : (indirect string, offset: 0xa2): page_idx
    <824>   DW_AT_decl_file   : 1
    <825>   DW_AT_decl_line   : 99
    <826>   DW_AT_decl_column : 9
    <827>   DW_AT_type        : <0x66>
    <82b>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><82e>: Abbrev Number: 28 (DW_TAG_variable)
    <82f>   DW_AT_name        : (indirect string, offset: 0x79): table_idx
    <833>   DW_AT_decl_file   : 1
    <834>   DW_AT_decl_line   : 100
    <835>   DW_AT_decl_column : 9
    <836>   DW_AT_type        : <0x66>
    <83a>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><83d>: Abbrev Number: 28 (DW_TAG_variable)
    <83e>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <842>   DW_AT_decl_file   : 1
    <843>   DW_AT_decl_line   : 105
    <844>   DW_AT_decl_column : 17
    <845>   DW_AT_type        : <0x4cf>
    <849>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><84c>: Abbrev Number: 34 (DW_TAG_subprogram)
    <84d>   DW_AT_external    : 1
    <84d>   DW_AT_name        : (indirect string, offset: 0x421): vmem_freeFrame
    <851>   DW_AT_decl_file   : 1
    <852>   DW_AT_decl_line   : 107
    <853>   DW_AT_decl_column : 5
    <854>   DW_AT_type        : <0x33>
    <858>   DW_AT_declaration : 1
    <858>   DW_AT_sibling     : <0x85e>
 <3><85c>: Abbrev Number: 35 (DW_TAG_unspecified_parameters)
 <3><85d>: Abbrev Number: 0
 <2><85e>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <85f>   DW_AT_ranges      : 0x0
 <3><863>: Abbrev Number: 27 (DW_TAG_variable)
    <864>   DW_AT_name        : i
    <866>   DW_AT_decl_file   : 1
    <867>   DW_AT_decl_line   : 111
    <868>   DW_AT_decl_column : 14
    <869>   DW_AT_type        : <0x33>
    <86d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20) [without DW_AT_frame_base]
 <3><870>: Abbrev Number: 0
 <2><871>: Abbrev Number: 0
 <1><872>: Abbrev Number: 29 (DW_TAG_subprogram)
    <873>   DW_AT_external    : 1
    <873>   DW_AT_name        : (indirect string, offset: 0x397): vmem_mapPage
    <877>   DW_AT_decl_file   : 1
    <878>   DW_AT_decl_line   : 86
    <879>   DW_AT_decl_column : 4
    <87a>   DW_AT_prototyped  : 1
    <87a>   DW_AT_type        : <0x41>
    <87e>   DW_AT_low_pc      : 0x104f9c
    <882>   DW_AT_high_pc     : 0x72
    <886>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <888>   DW_AT_GNU_all_tail_call_sites: 1
    <888>   DW_AT_sibling     : <0x8f6>
 <2><88c>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <88d>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <891>   DW_AT_decl_file   : 1
    <892>   DW_AT_decl_line   : 86
    <893>   DW_AT_decl_column : 23
    <894>   DW_AT_type        : <0x2b0>
    <898>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><89b>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <89c>   DW_AT_name        : (indirect string, offset: 0xb4): page_addr
    <8a0>   DW_AT_decl_file   : 1
    <8a1>   DW_AT_decl_line   : 86
    <8a2>   DW_AT_decl_column : 35
    <8a3>   DW_AT_type        : <0x66>
    <8a7>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><8aa>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x21e): pys_addr
    <8af>   DW_AT_decl_file   : 1
    <8b0>   DW_AT_decl_line   : 86
    <8b1>   DW_AT_decl_column : 50
    <8b2>   DW_AT_type        : <0x66>
    <8b6>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><8b9>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x3cd): attr
    <8be>   DW_AT_decl_file   : 1
    <8bf>   DW_AT_decl_line   : 86
    <8c0>   DW_AT_decl_column : 64
    <8c1>   DW_AT_type        : <0x66>
    <8c5>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><8c8>: Abbrev Number: 28 (DW_TAG_variable)
    <8c9>   DW_AT_name        : (indirect string, offset: 0xa2): page_idx
    <8cd>   DW_AT_decl_file   : 1
    <8ce>   DW_AT_decl_line   : 87
    <8cf>   DW_AT_decl_column : 9
    <8d0>   DW_AT_type        : <0x66>
    <8d4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8d7>: Abbrev Number: 28 (DW_TAG_variable)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x79): table_idx
    <8dc>   DW_AT_decl_file   : 1
    <8dd>   DW_AT_decl_line   : 88
    <8de>   DW_AT_decl_column : 9
    <8df>   DW_AT_type        : <0x66>
    <8e3>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><8e6>: Abbrev Number: 28 (DW_TAG_variable)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <8eb>   DW_AT_decl_file   : 1
    <8ec>   DW_AT_decl_line   : 93
    <8ed>   DW_AT_decl_column : 17
    <8ee>   DW_AT_type        : <0x4cf>
    <8f2>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><8f5>: Abbrev Number: 0
 <1><8f6>: Abbrev Number: 37 (DW_TAG_subprogram)
    <8f7>   DW_AT_external    : 1
    <8f7>   DW_AT_name        : (indirect string, offset: 0x401): vmem_createPage
    <8fb>   DW_AT_decl_file   : 1
    <8fc>   DW_AT_decl_line   : 74
    <8fd>   DW_AT_decl_column : 4
    <8fe>   DW_AT_prototyped  : 1
    <8fe>   DW_AT_type        : <0x41>
    <902>   DW_AT_low_pc      : 0x104edf
    <906>   DW_AT_high_pc     : 0xbd
    <90a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <90c>   DW_AT_GNU_all_call_sites: 1
    <90c>   DW_AT_sibling     : <0x94d>
 <2><910>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <911>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <915>   DW_AT_decl_file   : 1
    <916>   DW_AT_decl_line   : 74
    <917>   DW_AT_decl_column : 32
    <918>   DW_AT_type        : <0x4cf>
    <91c>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><91f>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <920>   DW_AT_name        : (indirect string, offset: 0x2cf): page
    <924>   DW_AT_decl_file   : 1
    <925>   DW_AT_decl_line   : 74
    <926>   DW_AT_decl_column : 43
    <927>   DW_AT_type        : <0x33>
    <92b>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><92e>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <92f>   DW_AT_name        : (indirect string, offset: 0x21e): pys_addr
    <933>   DW_AT_decl_file   : 1
    <934>   DW_AT_decl_line   : 74
    <935>   DW_AT_decl_column : 53
    <936>   DW_AT_type        : <0x66>
    <93a>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><93d>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <93e>   DW_AT_name        : (indirect string, offset: 0x3cd): attr
    <942>   DW_AT_decl_file   : 1
    <943>   DW_AT_decl_line   : 74
    <944>   DW_AT_decl_column : 67
    <945>   DW_AT_type        : <0x66>
    <949>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><94c>: Abbrev Number: 0
 <1><94d>: Abbrev Number: 24 (DW_TAG_subprogram)
    <94e>   DW_AT_external    : 1
    <94e>   DW_AT_name        : (indirect string, offset: 0x299): vmem_freeTable
    <952>   DW_AT_decl_file   : 1
    <953>   DW_AT_decl_line   : 65
    <954>   DW_AT_decl_column : 6
    <955>   DW_AT_prototyped  : 1
    <955>   DW_AT_low_pc      : 0x104e92
    <959>   DW_AT_high_pc     : 0x4d
    <95d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <95f>   DW_AT_GNU_all_tail_call_sites: 1
    <95f>   DW_AT_sibling     : <0x98f>
 <2><963>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <964>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <968>   DW_AT_decl_file   : 1
    <969>   DW_AT_decl_line   : 65
    <96a>   DW_AT_decl_column : 27
    <96b>   DW_AT_type        : <0x2b0>
    <96f>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><972>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <973>   DW_AT_name        : i
    <975>   DW_AT_decl_file   : 1
    <976>   DW_AT_decl_line   : 65
    <977>   DW_AT_decl_column : 39
    <978>   DW_AT_type        : <0x33>
    <97c>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><97f>: Abbrev Number: 28 (DW_TAG_variable)
    <980>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <984>   DW_AT_decl_file   : 1
    <985>   DW_AT_decl_line   : 68
    <986>   DW_AT_decl_column : 17
    <987>   DW_AT_type        : <0x4cf>
    <98b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><98e>: Abbrev Number: 0
 <1><98f>: Abbrev Number: 29 (DW_TAG_subprogram)
    <990>   DW_AT_external    : 1
    <990>   DW_AT_name        : (indirect string, offset: 0x41): vmem_createTable
    <994>   DW_AT_decl_file   : 1
    <995>   DW_AT_decl_line   : 55
    <996>   DW_AT_decl_column : 4
    <997>   DW_AT_prototyped  : 1
    <997>   DW_AT_type        : <0x41>
    <99b>   DW_AT_low_pc      : 0x104e34
    <99f>   DW_AT_high_pc     : 0x5e
    <9a3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9a5>   DW_AT_GNU_all_tail_call_sites: 1
    <9a5>   DW_AT_sibling     : <0x9d5>
 <2><9a9>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <9ae>   DW_AT_decl_file   : 1
    <9af>   DW_AT_decl_line   : 55
    <9b0>   DW_AT_decl_column : 27
    <9b1>   DW_AT_type        : <0x2b0>
    <9b5>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><9b8>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <9b9>   DW_AT_name        : i
    <9bb>   DW_AT_decl_file   : 1
    <9bc>   DW_AT_decl_line   : 55
    <9bd>   DW_AT_decl_column : 39
    <9be>   DW_AT_type        : <0x33>
    <9c2>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><9c5>: Abbrev Number: 28 (DW_TAG_variable)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <9ca>   DW_AT_decl_file   : 1
    <9cb>   DW_AT_decl_line   : 59
    <9cc>   DW_AT_decl_column : 17
    <9cd>   DW_AT_type        : <0x4cf>
    <9d1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9d4>: Abbrev Number: 0
 <1><9d5>: Abbrev Number: 37 (DW_TAG_subprogram)
    <9d6>   DW_AT_external    : 1
    <9d6>   DW_AT_name        : (indirect string, offset: 0x106): vmem_setTable
    <9da>   DW_AT_decl_file   : 1
    <9db>   DW_AT_decl_line   : 49
    <9dc>   DW_AT_decl_column : 4
    <9dd>   DW_AT_prototyped  : 1
    <9dd>   DW_AT_type        : <0x41>
    <9e1>   DW_AT_low_pc      : 0x104d49
    <9e5>   DW_AT_high_pc     : 0xeb
    <9e9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9eb>   DW_AT_GNU_all_call_sites: 1
    <9eb>   DW_AT_sibling     : <0xa1b>
 <2><9ef>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <9f4>   DW_AT_decl_file   : 1
    <9f5>   DW_AT_decl_line   : 49
    <9f6>   DW_AT_decl_column : 24
    <9f7>   DW_AT_type        : <0x2b0>
    <9fb>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><9fe>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <9ff>   DW_AT_name        : i
    <a01>   DW_AT_decl_file   : 1
    <a02>   DW_AT_decl_line   : 49
    <a03>   DW_AT_decl_column : 36
    <a04>   DW_AT_type        : <0x33>
    <a08>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><a0b>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <a10>   DW_AT_decl_file   : 1
    <a11>   DW_AT_decl_line   : 49
    <a12>   DW_AT_decl_column : 51
    <a13>   DW_AT_type        : <0x4cf>
    <a17>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><a1a>: Abbrev Number: 0
 <1><a1b>: Abbrev Number: 30 (DW_TAG_subprogram)
    <a1c>   DW_AT_external    : 1
    <a1c>   DW_AT_name        : (indirect string, offset: 0x1d6): vmem_allocTable
    <a20>   DW_AT_decl_file   : 1
    <a21>   DW_AT_decl_line   : 35
    <a22>   DW_AT_decl_column : 13
    <a23>   DW_AT_type        : <0x4cf>
    <a27>   DW_AT_low_pc      : 0x104ce5
    <a2b>   DW_AT_high_pc     : 0x64
    <a2f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a31>   DW_AT_GNU_all_tail_call_sites: 1
    <a31>   DW_AT_sibling     : <0xa5c>
 <2><a35>: Abbrev Number: 28 (DW_TAG_variable)
    <a36>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <a3a>   DW_AT_decl_file   : 1
    <a3b>   DW_AT_decl_line   : 36
    <a3c>   DW_AT_decl_column : 17
    <a3d>   DW_AT_type        : <0x4cf>
    <a41>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a44>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <a45>   DW_AT_low_pc      : 0x104d0f
    <a49>   DW_AT_high_pc     : 0x26
 <3><a4d>: Abbrev Number: 27 (DW_TAG_variable)
    <a4e>   DW_AT_name        : i
    <a50>   DW_AT_decl_file   : 1
    <a51>   DW_AT_decl_line   : 39
    <a52>   DW_AT_decl_column : 14
    <a53>   DW_AT_type        : <0x33>
    <a57>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><a5a>: Abbrev Number: 0
 <2><a5b>: Abbrev Number: 0
 <1><a5c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <a5d>   DW_AT_external    : 1
    <a5d>   DW_AT_name        : (indirect string, offset: 0x2ea): vmem_getPage
    <a61>   DW_AT_decl_file   : 1
    <a62>   DW_AT_decl_line   : 24
    <a63>   DW_AT_decl_column : 12
    <a64>   DW_AT_prototyped  : 1
    <a64>   DW_AT_type        : <0xac2>
    <a68>   DW_AT_low_pc      : 0x104c6f
    <a6c>   DW_AT_high_pc     : 0x76
    <a70>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a72>   DW_AT_GNU_all_tail_call_sites: 1
    <a72>   DW_AT_sibling     : <0xac2>
 <2><a76>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <a77>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <a7b>   DW_AT_decl_file   : 1
    <a7c>   DW_AT_decl_line   : 24
    <a7d>   DW_AT_decl_column : 31
    <a7e>   DW_AT_type        : <0x2b0>
    <a82>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><a85>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <a86>   DW_AT_name        : (indirect string, offset: 0xb4): page_addr
    <a8a>   DW_AT_decl_file   : 1
    <a8b>   DW_AT_decl_line   : 24
    <a8c>   DW_AT_decl_column : 43
    <a8d>   DW_AT_type        : <0x66>
    <a91>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><a94>: Abbrev Number: 28 (DW_TAG_variable)
    <a95>   DW_AT_name        : (indirect string, offset: 0xa2): page_idx
    <a99>   DW_AT_decl_file   : 1
    <a9a>   DW_AT_decl_line   : 25
    <a9b>   DW_AT_decl_column : 9
    <a9c>   DW_AT_type        : <0x66>
    <aa0>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><aa3>: Abbrev Number: 28 (DW_TAG_variable)
    <aa4>   DW_AT_name        : (indirect string, offset: 0x79): table_idx
    <aa8>   DW_AT_decl_file   : 1
    <aa9>   DW_AT_decl_line   : 26
    <aaa>   DW_AT_decl_column : 9
    <aab>   DW_AT_type        : <0x66>
    <aaf>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ab2>: Abbrev Number: 28 (DW_TAG_variable)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <ab7>   DW_AT_decl_file   : 1
    <ab8>   DW_AT_decl_line   : 31
    <ab9>   DW_AT_decl_column : 17
    <aba>   DW_AT_type        : <0x4cf>
    <abe>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ac1>: Abbrev Number: 0
 <1><ac2>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <ac3>   DW_AT_byte_size   : 4
    <ac4>   DW_AT_type        : <0x15c>
 <1><ac8>: Abbrev Number: 37 (DW_TAG_subprogram)
    <ac9>   DW_AT_external    : 1
    <ac9>   DW_AT_name        : (indirect string, offset: 0x2e): vmem_getTable
    <acd>   DW_AT_decl_file   : 1
    <ace>   DW_AT_decl_line   : 20
    <acf>   DW_AT_decl_column : 13
    <ad0>   DW_AT_prototyped  : 1
    <ad0>   DW_AT_type        : <0x4cf>
    <ad4>   DW_AT_low_pc      : 0x104c57
    <ad8>   DW_AT_high_pc     : 0x18
    <adc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ade>   DW_AT_GNU_all_call_sites: 1
    <ade>   DW_AT_sibling     : <0xb01>
 <2><ae2>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ae3>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <ae7>   DW_AT_decl_file   : 1
    <ae8>   DW_AT_decl_line   : 20
    <ae9>   DW_AT_decl_column : 33
    <aea>   DW_AT_type        : <0x2b0>
    <aee>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><af1>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <af2>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <af6>   DW_AT_decl_file   : 1
    <af7>   DW_AT_decl_line   : 20
    <af8>   DW_AT_decl_column : 45
    <af9>   DW_AT_type        : <0x33>
    <afd>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><b00>: Abbrev Number: 0
 <1><b01>: Abbrev Number: 37 (DW_TAG_subprogram)
    <b02>   DW_AT_external    : 1
    <b02>   DW_AT_name        : (indirect string, offset: 0x19c): vmem_tablePresent
    <b06>   DW_AT_decl_file   : 1
    <b07>   DW_AT_decl_line   : 16
    <b08>   DW_AT_decl_column : 4
    <b09>   DW_AT_prototyped  : 1
    <b09>   DW_AT_type        : <0x41>
    <b0d>   DW_AT_low_pc      : 0x104c41
    <b11>   DW_AT_high_pc     : 0x16
    <b15>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b17>   DW_AT_GNU_all_call_sites: 1
    <b17>   DW_AT_sibling     : <0xb3a>
 <2><b1b>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x430): virmem
    <b20>   DW_AT_decl_file   : 1
    <b21>   DW_AT_decl_line   : 16
    <b22>   DW_AT_decl_column : 28
    <b23>   DW_AT_type        : <0x2b0>
    <b27>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><b2a>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x97c): table
    <b2f>   DW_AT_decl_file   : 1
    <b30>   DW_AT_decl_line   : 16
    <b31>   DW_AT_decl_column : 40
    <b32>   DW_AT_type        : <0x33>
    <b36>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><b39>: Abbrev Number: 0
 <1><b3a>: Abbrev Number: 38 (DW_TAG_subprogram)
    <b3b>   DW_AT_external    : 1
    <b3b>   DW_AT_name        : (indirect string, offset: 0x9): vmem_current
    <b3f>   DW_AT_decl_file   : 1
    <b40>   DW_AT_decl_line   : 12
    <b41>   DW_AT_decl_column : 7
    <b42>   DW_AT_type        : <0x2b0>
    <b46>   DW_AT_low_pc      : 0x104c33
    <b4a>   DW_AT_high_pc     : 0xe
    <b4e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b50>   DW_AT_GNU_all_call_sites: 1
 <1><b50>: Abbrev Number: 0
  Compilation Unit @ offset 0xb51:
   Length:        0x74e (32-bit)
   Version:       4
   Abbrev Offset: 0x2bb
   Pointer Size:  4
 <0><b5c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <b5d>   DW_AT_producer    : (indirect string, offset: 0x5d9): GNU C++14 9.4.0 -m32 -mtune=generic -march=i686 -g -fno-exceptions -fno-rtti -fno-pie -ffreestanding -fasynchronous-unwind-tables -fstack-clash-protection -fcf-protection
    <b61>   DW_AT_language    : 4	(C++)
    <b62>   DW_AT_name        : (indirect string, offset: 0x4a4): src/kernel/main.cpp
    <b66>   DW_AT_comp_dir    : (indirect string, offset: 0x162): /home/iliashdz/Desktop/Projects/apostrof
    <b6a>   DW_AT_low_pc      : 0x10affb
    <b6e>   DW_AT_high_pc     : 0x265
    <b72>   DW_AT_stmt_list   : 0x4a4
 <1><b76>: Abbrev Number: 2 (DW_TAG_base_type)
    <b77>   DW_AT_byte_size   : 1
    <b78>   DW_AT_encoding    : 6	(signed char)
    <b79>   DW_AT_name        : (indirect string, offset: 0x1ef): char
 <1><b7d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b7e>   DW_AT_type        : <0xb76>
 <1><b82>: Abbrev Number: 2 (DW_TAG_base_type)
    <b83>   DW_AT_byte_size   : 2
    <b84>   DW_AT_encoding    : 5	(signed)
    <b85>   DW_AT_name        : (indirect string, offset: 0x6f): short int
 <1><b89>: Abbrev Number: 4 (DW_TAG_base_type)
    <b8a>   DW_AT_byte_size   : 4
    <b8b>   DW_AT_encoding    : 5	(signed)
    <b8c>   DW_AT_name        : int
 <1><b90>: Abbrev Number: 2 (DW_TAG_base_type)
    <b91>   DW_AT_byte_size   : 8
    <b92>   DW_AT_encoding    : 5	(signed)
    <b93>   DW_AT_name        : (indirect string, offset: 0x128): long long int
 <1><b97>: Abbrev Number: 5 (DW_TAG_typedef)
    <b98>   DW_AT_name        : u8
    <b9b>   DW_AT_decl_file   : 2
    <b9c>   DW_AT_decl_line   : 10
    <b9d>   DW_AT_decl_column : 28
    <b9e>   DW_AT_type        : <0xba2>
 <1><ba2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ba3>   DW_AT_byte_size   : 1
    <ba4>   DW_AT_encoding    : 8	(unsigned char)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x1e6): unsigned char
 <1><ba9>: Abbrev Number: 5 (DW_TAG_typedef)
    <baa>   DW_AT_name        : u16
    <bae>   DW_AT_decl_file   : 2
    <baf>   DW_AT_decl_line   : 11
    <bb0>   DW_AT_decl_column : 28
    <bb1>   DW_AT_type        : <0xbb5>
 <1><bb5>: Abbrev Number: 2 (DW_TAG_base_type)
    <bb6>   DW_AT_byte_size   : 2
    <bb7>   DW_AT_encoding    : 7	(unsigned)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x286): short unsigned int
 <1><bbc>: Abbrev Number: 5 (DW_TAG_typedef)
    <bbd>   DW_AT_name        : u32
    <bc1>   DW_AT_decl_file   : 2
    <bc2>   DW_AT_decl_line   : 12
    <bc3>   DW_AT_decl_column : 28
    <bc4>   DW_AT_type        : <0xbc8>
 <1><bc8>: Abbrev Number: 2 (DW_TAG_base_type)
    <bc9>   DW_AT_byte_size   : 4
    <bca>   DW_AT_encoding    : 7	(unsigned)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x205): unsigned int
 <1><bcf>: Abbrev Number: 2 (DW_TAG_base_type)
    <bd0>   DW_AT_byte_size   : 8
    <bd1>   DW_AT_encoding    : 7	(unsigned)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x1fb): long long unsigned int
 <1><bd6>: Abbrev Number: 2 (DW_TAG_base_type)
    <bd7>   DW_AT_byte_size   : 4
    <bd8>   DW_AT_encoding    : 4	(float)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x114): float
 <1><bdd>: Abbrev Number: 2 (DW_TAG_base_type)
    <bde>   DW_AT_byte_size   : 8
    <bdf>   DW_AT_encoding    : 4	(float)
    <be0>   DW_AT_name        : (indirect string, offset: 0x3a4): double
 <1><be4>: Abbrev Number: 6 (DW_TAG_structure_type)
    <be5>   DW_AT_name        : fd
    <be8>   DW_AT_byte_size   : 24
    <be9>   DW_AT_decl_file   : 3
    <bea>   DW_AT_decl_line   : 19
    <beb>   DW_AT_decl_column : 16
    <bec>   DW_AT_sibling     : <0xc3f>
 <2><bf0>: Abbrev Number: 7 (DW_TAG_member)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x437): magic
    <bf5>   DW_AT_decl_file   : 3
    <bf6>   DW_AT_decl_line   : 20
    <bf7>   DW_AT_decl_column : 9
    <bf8>   DW_AT_type        : <0xbbc>
    <bfc>   DW_AT_data_member_location: 0
 <2><bfd>: Abbrev Number: 7 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x984): type
    <c02>   DW_AT_decl_file   : 3
    <c03>   DW_AT_decl_line   : 21
    <c04>   DW_AT_decl_column : 8
    <c05>   DW_AT_type        : <0xb97>
    <c09>   DW_AT_data_member_location: 4
 <2><c0a>: Abbrev Number: 7 (DW_TAG_member)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x2f7): buffer
    <c0f>   DW_AT_decl_file   : 3
    <c10>   DW_AT_decl_line   : 23
    <c11>   DW_AT_decl_column : 11
    <c12>   DW_AT_type        : <0xc3f>
    <c16>   DW_AT_data_member_location: 8
 <2><c17>: Abbrev Number: 7 (DW_TAG_member)
    <c18>   DW_AT_name        : (indirect string, offset: 0x212): buffer_size
    <c1c>   DW_AT_decl_file   : 3
    <c1d>   DW_AT_decl_line   : 24
    <c1e>   DW_AT_decl_column : 11
    <c1f>   DW_AT_type        : <0xbbc>
    <c23>   DW_AT_data_member_location: 12
 <2><c24>: Abbrev Number: 7 (DW_TAG_member)
    <c25>   DW_AT_name        : (indirect string, offset: 0x3c): pipe
    <c29>   DW_AT_decl_file   : 3
    <c2a>   DW_AT_decl_line   : 26
    <c2b>   DW_AT_decl_column : 16
    <c2c>   DW_AT_type        : <0xc45>
    <c30>   DW_AT_data_member_location: 16
 <2><c31>: Abbrev Number: 7 (DW_TAG_member)
    <c32>   DW_AT_name        : (indirect string, offset: 0x1f4): cursor
    <c36>   DW_AT_decl_file   : 3
    <c37>   DW_AT_decl_line   : 28
    <c38>   DW_AT_decl_column : 8
    <c39>   DW_AT_type        : <0xb97>
    <c3d>   DW_AT_data_member_location: 20
 <2><c3e>: Abbrev Number: 0
 <1><c3f>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c40>   DW_AT_byte_size   : 4
    <c41>   DW_AT_type        : <0xb76>
 <1><c45>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c46>   DW_AT_byte_size   : 4
    <c47>   DW_AT_type        : <0xbe4>
 <1><c4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <c4c>   DW_AT_name        : fd
    <c4f>   DW_AT_decl_file   : 3
    <c50>   DW_AT_decl_line   : 29
    <c51>   DW_AT_decl_column : 3
    <c52>   DW_AT_type        : <0xbe4>
 <1><c56>: Abbrev Number: 9 (DW_TAG_variable)
    <c57>   DW_AT_name        : (indirect string, offset: 0x63): void_stream
    <c5b>   DW_AT_decl_file   : 3
    <c5c>   DW_AT_decl_line   : 31
    <c5d>   DW_AT_decl_column : 12
    <c5e>   DW_AT_type        : <0xc62>
    <c62>   DW_AT_external    : 1
    <c62>   DW_AT_declaration : 1
 <1><c62>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c63>   DW_AT_byte_size   : 4
    <c64>   DW_AT_type        : <0xc4b>
 <1><c68>: Abbrev Number: 9 (DW_TAG_variable)
    <c69>   DW_AT_name        : (indirect string, offset: 0x83): cursor_y
    <c6d>   DW_AT_decl_file   : 4
    <c6e>   DW_AT_decl_line   : 29
    <c6f>   DW_AT_decl_column : 11
    <c70>   DW_AT_type        : <0xb97>
    <c74>   DW_AT_external    : 1
    <c74>   DW_AT_declaration : 1
 <1><c74>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c75>   DW_AT_byte_size   : 64
    <c76>   DW_AT_decl_file   : 5
    <c77>   DW_AT_decl_line   : 72
    <c78>   DW_AT_decl_column : 16
    <c79>   DW_AT_linkage_name: (indirect string, offset: 0x6d8): 8isr_regs
    <c7d>   DW_AT_sibling     : <0xd4f>
 <2><c81>: Abbrev Number: 11 (DW_TAG_member)
    <c82>   DW_AT_name        : ds
    <c85>   DW_AT_decl_file   : 5
    <c86>   DW_AT_decl_line   : 73
    <c87>   DW_AT_decl_column : 8
    <c88>   DW_AT_type        : <0xbbc>
    <c8c>   DW_AT_data_member_location: 0
 <2><c8d>: Abbrev Number: 11 (DW_TAG_member)
    <c8e>   DW_AT_name        : edi
    <c92>   DW_AT_decl_file   : 5
    <c93>   DW_AT_decl_line   : 74
    <c94>   DW_AT_decl_column : 8
    <c95>   DW_AT_type        : <0xbbc>
    <c99>   DW_AT_data_member_location: 4
 <2><c9a>: Abbrev Number: 11 (DW_TAG_member)
    <c9b>   DW_AT_name        : esi
    <c9f>   DW_AT_decl_file   : 5
    <ca0>   DW_AT_decl_line   : 74
    <ca1>   DW_AT_decl_column : 13
    <ca2>   DW_AT_type        : <0xbbc>
    <ca6>   DW_AT_data_member_location: 8
 <2><ca7>: Abbrev Number: 11 (DW_TAG_member)
    <ca8>   DW_AT_name        : ebp
    <cac>   DW_AT_decl_file   : 5
    <cad>   DW_AT_decl_line   : 74
    <cae>   DW_AT_decl_column : 18
    <caf>   DW_AT_type        : <0xbbc>
    <cb3>   DW_AT_data_member_location: 12
 <2><cb4>: Abbrev Number: 11 (DW_TAG_member)
    <cb5>   DW_AT_name        : esp
    <cb9>   DW_AT_decl_file   : 5
    <cba>   DW_AT_decl_line   : 74
    <cbb>   DW_AT_decl_column : 23
    <cbc>   DW_AT_type        : <0xbbc>
    <cc0>   DW_AT_data_member_location: 16
 <2><cc1>: Abbrev Number: 11 (DW_TAG_member)
    <cc2>   DW_AT_name        : ebx
    <cc6>   DW_AT_decl_file   : 5
    <cc7>   DW_AT_decl_line   : 74
    <cc8>   DW_AT_decl_column : 28
    <cc9>   DW_AT_type        : <0xbbc>
    <ccd>   DW_AT_data_member_location: 20
 <2><cce>: Abbrev Number: 11 (DW_TAG_member)
    <ccf>   DW_AT_name        : edx
    <cd3>   DW_AT_decl_file   : 5
    <cd4>   DW_AT_decl_line   : 74
    <cd5>   DW_AT_decl_column : 33
    <cd6>   DW_AT_type        : <0xbbc>
    <cda>   DW_AT_data_member_location: 24
 <2><cdb>: Abbrev Number: 11 (DW_TAG_member)
    <cdc>   DW_AT_name        : ecx
    <ce0>   DW_AT_decl_file   : 5
    <ce1>   DW_AT_decl_line   : 74
    <ce2>   DW_AT_decl_column : 38
    <ce3>   DW_AT_type        : <0xbbc>
    <ce7>   DW_AT_data_member_location: 28
 <2><ce8>: Abbrev Number: 11 (DW_TAG_member)
    <ce9>   DW_AT_name        : eax
    <ced>   DW_AT_decl_file   : 5
    <cee>   DW_AT_decl_line   : 74
    <cef>   DW_AT_decl_column : 43
    <cf0>   DW_AT_type        : <0xbbc>
    <cf4>   DW_AT_data_member_location: 32
 <2><cf5>: Abbrev Number: 7 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x565): int_no
    <cfa>   DW_AT_decl_file   : 5
    <cfb>   DW_AT_decl_line   : 75
    <cfc>   DW_AT_decl_column : 8
    <cfd>   DW_AT_type        : <0xbbc>
    <d01>   DW_AT_data_member_location: 36
 <2><d02>: Abbrev Number: 7 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0x5b0): err_code
    <d07>   DW_AT_decl_file   : 5
    <d08>   DW_AT_decl_line   : 75
    <d09>   DW_AT_decl_column : 16
    <d0a>   DW_AT_type        : <0xbbc>
    <d0e>   DW_AT_data_member_location: 40
 <2><d0f>: Abbrev Number: 11 (DW_TAG_member)
    <d10>   DW_AT_name        : eip
    <d14>   DW_AT_decl_file   : 5
    <d15>   DW_AT_decl_line   : 76
    <d16>   DW_AT_decl_column : 8
    <d17>   DW_AT_type        : <0xbbc>
    <d1b>   DW_AT_data_member_location: 44
 <2><d1c>: Abbrev Number: 11 (DW_TAG_member)
    <d1d>   DW_AT_name        : cs
    <d20>   DW_AT_decl_file   : 5
    <d21>   DW_AT_decl_line   : 76
    <d22>   DW_AT_decl_column : 13
    <d23>   DW_AT_type        : <0xbbc>
    <d27>   DW_AT_data_member_location: 48
 <2><d28>: Abbrev Number: 7 (DW_TAG_member)
    <d29>   DW_AT_name        : (indirect string, offset: 0x48a): eflags
    <d2d>   DW_AT_decl_file   : 5
    <d2e>   DW_AT_decl_line   : 76
    <d2f>   DW_AT_decl_column : 17
    <d30>   DW_AT_type        : <0xbbc>
    <d34>   DW_AT_data_member_location: 52
 <2><d35>: Abbrev Number: 7 (DW_TAG_member)
    <d36>   DW_AT_name        : (indirect string, offset: 0x515): useresp
    <d3a>   DW_AT_decl_file   : 5
    <d3b>   DW_AT_decl_line   : 76
    <d3c>   DW_AT_decl_column : 25
    <d3d>   DW_AT_type        : <0xbbc>
    <d41>   DW_AT_data_member_location: 56
 <2><d42>: Abbrev Number: 11 (DW_TAG_member)
    <d43>   DW_AT_name        : ss
    <d46>   DW_AT_decl_file   : 5
    <d47>   DW_AT_decl_line   : 76
    <d48>   DW_AT_decl_column : 34
    <d49>   DW_AT_type        : <0xbbc>
    <d4d>   DW_AT_data_member_location: 60
 <2><d4e>: Abbrev Number: 0
 <1><d4f>: Abbrev Number: 12 (DW_TAG_typedef)
    <d50>   DW_AT_name        : (indirect string, offset: 0x6d9): isr_regs
    <d54>   DW_AT_decl_file   : 5
    <d55>   DW_AT_decl_line   : 77
    <d56>   DW_AT_decl_column : 27
    <d57>   DW_AT_type        : <0xc74>
 <1><d5b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d5c>   DW_AT_byte_size   : 4
    <d5d>   DW_AT_type        : <0xd4f>
 <1><d61>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d62>   DW_AT_byte_size   : 8
    <d63>   DW_AT_decl_file   : 6
    <d64>   DW_AT_decl_line   : 7
    <d65>   DW_AT_decl_column : 16
    <d66>   DW_AT_linkage_name: (indirect string, offset: 0x6a6): 8idt_gate
    <d6a>   DW_AT_sibling     : <0xdb0>
 <2><d6e>: Abbrev Number: 7 (DW_TAG_member)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x5a8): loffset
    <d73>   DW_AT_decl_file   : 6
    <d74>   DW_AT_decl_line   : 8
    <d75>   DW_AT_decl_column : 9
    <d76>   DW_AT_type        : <0xba9>
    <d7a>   DW_AT_data_member_location: 0
 <2><d7b>: Abbrev Number: 11 (DW_TAG_member)
    <d7c>   DW_AT_name        : sel
    <d80>   DW_AT_decl_file   : 6
    <d81>   DW_AT_decl_line   : 9
    <d82>   DW_AT_decl_column : 9
    <d83>   DW_AT_type        : <0xba9>
    <d87>   DW_AT_data_member_location: 2
 <2><d88>: Abbrev Number: 7 (DW_TAG_member)
    <d89>   DW_AT_name        : (indirect string, offset: 0x5a0): always0
    <d8d>   DW_AT_decl_file   : 6
    <d8e>   DW_AT_decl_line   : 10
    <d8f>   DW_AT_decl_column : 9
    <d90>   DW_AT_type        : <0xb97>
    <d94>   DW_AT_data_member_location: 4
 <2><d95>: Abbrev Number: 7 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0xaac): flags
    <d9a>   DW_AT_decl_file   : 6
    <d9b>   DW_AT_decl_line   : 11
    <d9c>   DW_AT_decl_column : 9
    <d9d>   DW_AT_type        : <0xb97>
    <da1>   DW_AT_data_member_location: 5
 <2><da2>: Abbrev Number: 7 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0x6c4): hoffset
    <da7>   DW_AT_decl_file   : 6
    <da8>   DW_AT_decl_line   : 12
    <da9>   DW_AT_decl_column : 9
    <daa>   DW_AT_type        : <0xba9>
    <dae>   DW_AT_data_member_location: 6
 <2><daf>: Abbrev Number: 0
 <1><db0>: Abbrev Number: 12 (DW_TAG_typedef)
    <db1>   DW_AT_name        : (indirect string, offset: 0x6a7): idt_gate
    <db5>   DW_AT_decl_file   : 6
    <db6>   DW_AT_decl_line   : 13
    <db7>   DW_AT_decl_column : 27
    <db8>   DW_AT_type        : <0xd61>
 <1><dbc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <dbd>   DW_AT_byte_size   : 6
    <dbe>   DW_AT_decl_file   : 6
    <dbf>   DW_AT_decl_line   : 15
    <dc0>   DW_AT_decl_column : 16
    <dc1>   DW_AT_linkage_name: (indirect string, offset: 0x592): 11idt_pointer
    <dc5>   DW_AT_sibling     : <0xde4>
 <2><dc9>: Abbrev Number: 7 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0x457): limit
    <dce>   DW_AT_decl_file   : 6
    <dcf>   DW_AT_decl_line   : 16
    <dd0>   DW_AT_decl_column : 9
    <dd1>   DW_AT_type        : <0xba9>
    <dd5>   DW_AT_data_member_location: 0
 <2><dd6>: Abbrev Number: 7 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x554): base
    <ddb>   DW_AT_decl_file   : 6
    <ddc>   DW_AT_decl_line   : 17
    <ddd>   DW_AT_decl_column : 9
    <dde>   DW_AT_type        : <0xbbc>
    <de2>   DW_AT_data_member_location: 2
 <2><de3>: Abbrev Number: 0
 <1><de4>: Abbrev Number: 12 (DW_TAG_typedef)
    <de5>   DW_AT_name        : (indirect string, offset: 0x594): idt_pointer
    <de9>   DW_AT_decl_file   : 6
    <dea>   DW_AT_decl_line   : 18
    <deb>   DW_AT_decl_column : 27
    <dec>   DW_AT_type        : <0xdbc>
 <1><df0>: Abbrev Number: 13 (DW_TAG_array_type)
    <df1>   DW_AT_type        : <0xdb0>
    <df5>   DW_AT_sibling     : <0xe00>
 <2><df9>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <dfa>   DW_AT_type        : <0xbc8>
    <dfe>   DW_AT_upper_bound : 255
 <2><dff>: Abbrev Number: 0
 <1><e00>: Abbrev Number: 15 (DW_TAG_variable)
    <e01>   DW_AT_name        : idt
    <e05>   DW_AT_decl_file   : 6
    <e06>   DW_AT_decl_line   : 21
    <e07>   DW_AT_decl_column : 13
    <e08>   DW_AT_type        : <0xdf0>
    <e0c>   DW_AT_external    : 1
    <e0c>   DW_AT_location    : 5 byte block: 3 40 f7 12 0 	(DW_OP_addr: 12f740)
 <1><e12>: Abbrev Number: 16 (DW_TAG_variable)
    <e13>   DW_AT_name        : (indirect string, offset: 0x46f): idt_ptr
    <e17>   DW_AT_decl_file   : 6
    <e18>   DW_AT_decl_line   : 22
    <e19>   DW_AT_decl_column : 13
    <e1a>   DW_AT_type        : <0xde4>
    <e1e>   DW_AT_external    : 1
    <e1e>   DW_AT_location    : 5 byte block: 3 40 ff 12 0 	(DW_OP_addr: 12ff40)
 <1><e24>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <e25>   DW_AT_encoding    : 7	(unsigned)
    <e26>   DW_AT_byte_size   : 4
    <e27>   DW_AT_type        : <0xbc8>
    <e2b>   DW_AT_decl_file   : 7
    <e2c>   DW_AT_decl_line   : 5
    <e2d>   DW_AT_decl_column : 14
    <e2e>   DW_AT_linkage_name: (indirect string, offset: 0x68c): 10DRIVE_TYPE
    <e32>   DW_AT_sibling     : <0xe43>
 <2><e36>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e37>   DW_AT_name        : (indirect string, offset: 0x576): PARTITION
    <e3b>   DW_AT_const_value : 0
 <2><e3c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x56c): DRIVE_IDE
    <e41>   DW_AT_const_value : 1
 <2><e42>: Abbrev Number: 0
 <1><e43>: Abbrev Number: 12 (DW_TAG_typedef)
    <e44>   DW_AT_name        : (indirect string, offset: 0x68e): DRIVE_TYPE
    <e48>   DW_AT_decl_file   : 7
    <e49>   DW_AT_decl_line   : 8
    <e4a>   DW_AT_decl_column : 3
    <e4b>   DW_AT_type        : <0xe24>
 <1><e4f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e50>   DW_AT_byte_size   : 12
    <e51>   DW_AT_decl_file   : 7
    <e52>   DW_AT_decl_line   : 10
    <e53>   DW_AT_decl_column : 16
    <e54>   DW_AT_linkage_name: (indirect string, offset: 0x69f): 5drive
    <e58>   DW_AT_sibling     : <0xe84>
 <2><e5c>: Abbrev Number: 7 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x984): type
    <e61>   DW_AT_decl_file   : 7
    <e62>   DW_AT_decl_line   : 11
    <e63>   DW_AT_decl_column : 16
    <e64>   DW_AT_type        : <0xe43>
    <e68>   DW_AT_data_member_location: 0
 <2><e69>: Abbrev Number: 7 (DW_TAG_member)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x559): device_name
    <e6e>   DW_AT_decl_file   : 7
    <e6f>   DW_AT_decl_line   : 13
    <e70>   DW_AT_decl_column : 11
    <e71>   DW_AT_type        : <0xc3f>
    <e75>   DW_AT_data_member_location: 4
 <2><e76>: Abbrev Number: 7 (DW_TAG_member)
    <e77>   DW_AT_name        : (indirect string, offset: 0x47c): size
    <e7b>   DW_AT_decl_file   : 7
    <e7c>   DW_AT_decl_line   : 14
    <e7d>   DW_AT_decl_column : 11
    <e7e>   DW_AT_type        : <0xbbc>
    <e82>   DW_AT_data_member_location: 8
 <2><e83>: Abbrev Number: 0
 <1><e84>: Abbrev Number: 12 (DW_TAG_typedef)
    <e85>   DW_AT_name        : (indirect string, offset: 0x6a0): drive
    <e89>   DW_AT_decl_file   : 7
    <e8a>   DW_AT_decl_line   : 15
    <e8b>   DW_AT_decl_column : 3
    <e8c>   DW_AT_type        : <0xe4f>
 <1><e90>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e91>   DW_AT_byte_size   : 4
    <e92>   DW_AT_type        : <0xe84>
 <1><e96>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e97>   DW_AT_byte_size   : 28
    <e98>   DW_AT_decl_file   : 8
    <e99>   DW_AT_decl_line   : 6
    <e9a>   DW_AT_decl_column : 16
    <e9b>   DW_AT_linkage_name: (indirect string, offset: 0x6bc): 6apo_fs
    <e9f>   DW_AT_sibling     : <0xeff>
 <2><ea3>: Abbrev Number: 7 (DW_TAG_member)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x491): device
    <ea8>   DW_AT_decl_file   : 8
    <ea9>   DW_AT_decl_line   : 7
    <eaa>   DW_AT_decl_column : 12
    <eab>   DW_AT_type        : <0xe90>
    <eaf>   DW_AT_data_member_location: 0
 <2><eb0>: Abbrev Number: 7 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x6cc): bitmap_base
    <eb5>   DW_AT_decl_file   : 8
    <eb6>   DW_AT_decl_line   : 9
    <eb7>   DW_AT_decl_column : 9
    <eb8>   DW_AT_type        : <0xbbc>
    <ebc>   DW_AT_data_member_location: 4
 <2><ebd>: Abbrev Number: 7 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x54e): table_base
    <ec2>   DW_AT_decl_file   : 8
    <ec3>   DW_AT_decl_line   : 10
    <ec4>   DW_AT_decl_column : 9
    <ec5>   DW_AT_type        : <0xbbc>
    <ec9>   DW_AT_data_member_location: 8
 <2><eca>: Abbrev Number: 7 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x50b): file_base
    <ecf>   DW_AT_decl_file   : 8
    <ed0>   DW_AT_decl_line   : 11
    <ed1>   DW_AT_decl_column : 9
    <ed2>   DW_AT_type        : <0xbbc>
    <ed6>   DW_AT_data_member_location: 12
 <2><ed7>: Abbrev Number: 7 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x477): desc_size
    <edc>   DW_AT_decl_file   : 8
    <edd>   DW_AT_decl_line   : 12
    <ede>   DW_AT_decl_column : 9
    <edf>   DW_AT_type        : <0xba9>
    <ee3>   DW_AT_data_member_location: 16
 <2><ee4>: Abbrev Number: 7 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x263): bitmap
    <ee9>   DW_AT_decl_file   : 8
    <eea>   DW_AT_decl_line   : 14
    <eeb>   DW_AT_decl_column : 9
    <eec>   DW_AT_type        : <0xeff>
    <ef0>   DW_AT_data_member_location: 20
 <2><ef1>: Abbrev Number: 7 (DW_TAG_member)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x4da): bitmap_size
    <ef6>   DW_AT_decl_file   : 8
    <ef7>   DW_AT_decl_line   : 15
    <ef8>   DW_AT_decl_column : 9
    <ef9>   DW_AT_type        : <0xbbc>
    <efd>   DW_AT_data_member_location: 24
 <2><efe>: Abbrev Number: 0
 <1><eff>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f00>   DW_AT_byte_size   : 4
    <f01>   DW_AT_type        : <0xb97>
 <1><f05>: Abbrev Number: 12 (DW_TAG_typedef)
    <f06>   DW_AT_name        : (indirect string, offset: 0x6bd): apo_fs
    <f0a>   DW_AT_decl_file   : 8
    <f0b>   DW_AT_decl_line   : 16
    <f0c>   DW_AT_decl_column : 3
    <f0d>   DW_AT_type        : <0xe96>
 <1><f11>: Abbrev Number: 9 (DW_TAG_variable)
    <f12>   DW_AT_name        : (indirect string, offset: 0x541): current_root
    <f16>   DW_AT_decl_file   : 8
    <f17>   DW_AT_decl_line   : 26
    <f18>   DW_AT_decl_column : 16
    <f19>   DW_AT_type        : <0xf1d>
    <f1d>   DW_AT_external    : 1
    <f1d>   DW_AT_declaration : 1
 <1><f1d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f1e>   DW_AT_byte_size   : 4
    <f1f>   DW_AT_type        : <0xf05>
 <1><f23>: Abbrev Number: 19 (DW_TAG_structure_type)
    <f24>   DW_AT_name        : (indirect string, offset: 0x52): vmem_table_entry
    <f28>   DW_AT_byte_size   : 4
    <f29>   DW_AT_decl_file   : 9
    <f2a>   DW_AT_decl_line   : 35
    <f2b>   DW_AT_decl_column : 16
    <f2c>   DW_AT_sibling     : <0xfe1>
 <2><f30>: Abbrev Number: 20 (DW_TAG_member)
    <f31>   DW_AT_name        : (indirect string, offset: 0x917): present
    <f35>   DW_AT_decl_file   : 9
    <f36>   DW_AT_decl_line   : 36
    <f37>   DW_AT_decl_column : 9
    <f38>   DW_AT_type        : <0xbbc>
    <f3c>   DW_AT_byte_size   : 4
    <f3d>   DW_AT_bit_size    : 1
    <f3e>   DW_AT_bit_offset  : 31
    <f3f>   DW_AT_data_member_location: 0
 <2><f40>: Abbrev Number: 20 (DW_TAG_member)
    <f41>   DW_AT_name        : (indirect string, offset: 0x0): writable
    <f45>   DW_AT_decl_file   : 9
    <f46>   DW_AT_decl_line   : 37
    <f47>   DW_AT_decl_column : 9
    <f48>   DW_AT_type        : <0xbbc>
    <f4c>   DW_AT_byte_size   : 4
    <f4d>   DW_AT_bit_size    : 1
    <f4e>   DW_AT_bit_offset  : 30
    <f4f>   DW_AT_data_member_location: 0
 <2><f50>: Abbrev Number: 20 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0x281): user
    <f55>   DW_AT_decl_file   : 9
    <f56>   DW_AT_decl_line   : 38
    <f57>   DW_AT_decl_column : 9
    <f58>   DW_AT_type        : <0xbbc>
    <f5c>   DW_AT_byte_size   : 4
    <f5d>   DW_AT_bit_size    : 1
    <f5e>   DW_AT_bit_offset  : 29
    <f5f>   DW_AT_data_member_location: 0
 <2><f60>: Abbrev Number: 21 (DW_TAG_member)
    <f61>   DW_AT_name        : pwt
    <f65>   DW_AT_decl_file   : 9
    <f66>   DW_AT_decl_line   : 39
    <f67>   DW_AT_decl_column : 9
    <f68>   DW_AT_type        : <0xbbc>
    <f6c>   DW_AT_byte_size   : 4
    <f6d>   DW_AT_bit_size    : 1
    <f6e>   DW_AT_bit_offset  : 28
    <f6f>   DW_AT_data_member_location: 0
 <2><f70>: Abbrev Number: 21 (DW_TAG_member)
    <f71>   DW_AT_name        : pcd
    <f75>   DW_AT_decl_file   : 9
    <f76>   DW_AT_decl_line   : 40
    <f77>   DW_AT_decl_column : 9
    <f78>   DW_AT_type        : <0xbbc>
    <f7c>   DW_AT_byte_size   : 4
    <f7d>   DW_AT_bit_size    : 1
    <f7e>   DW_AT_bit_offset  : 27
    <f7f>   DW_AT_data_member_location: 0
 <2><f80>: Abbrev Number: 20 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0xab): accessed
    <f85>   DW_AT_decl_file   : 9
    <f86>   DW_AT_decl_line   : 41
    <f87>   DW_AT_decl_column : 9
    <f88>   DW_AT_type        : <0xbbc>
    <f8c>   DW_AT_byte_size   : 4
    <f8d>   DW_AT_bit_size    : 1
    <f8e>   DW_AT_bit_offset  : 26
    <f8f>   DW_AT_data_member_location: 0
 <2><f90>: Abbrev Number: 20 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0x3ec): intelresv
    <f95>   DW_AT_decl_file   : 9
    <f96>   DW_AT_decl_line   : 42
    <f97>   DW_AT_decl_column : 9
    <f98>   DW_AT_type        : <0xbbc>
    <f9c>   DW_AT_byte_size   : 4
    <f9d>   DW_AT_bit_size    : 1
    <f9e>   DW_AT_bit_offset  : 25
    <f9f>   DW_AT_data_member_location: 0
 <2><fa0>: Abbrev Number: 20 (DW_TAG_member)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x2a8): four_mb
    <fa5>   DW_AT_decl_file   : 9
    <fa6>   DW_AT_decl_line   : 43
    <fa7>   DW_AT_decl_column : 9
    <fa8>   DW_AT_type        : <0xbbc>
    <fac>   DW_AT_byte_size   : 4
    <fad>   DW_AT_bit_size    : 1
    <fae>   DW_AT_bit_offset  : 24
    <faf>   DW_AT_data_member_location: 0
 <2><fb0>: Abbrev Number: 20 (DW_TAG_member)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x2be): global
    <fb5>   DW_AT_decl_file   : 9
    <fb6>   DW_AT_decl_line   : 44
    <fb7>   DW_AT_decl_column : 9
    <fb8>   DW_AT_type        : <0xbbc>
    <fbc>   DW_AT_byte_size   : 4
    <fbd>   DW_AT_bit_size    : 1
    <fbe>   DW_AT_bit_offset  : 23
    <fbf>   DW_AT_data_member_location: 0
 <2><fc0>: Abbrev Number: 20 (DW_TAG_member)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x43d): reserved
    <fc5>   DW_AT_decl_file   : 9
    <fc6>   DW_AT_decl_line   : 45
    <fc7>   DW_AT_decl_column : 9
    <fc8>   DW_AT_type        : <0xbbc>
    <fcc>   DW_AT_byte_size   : 4
    <fcd>   DW_AT_bit_size    : 3
    <fce>   DW_AT_bit_offset  : 20
    <fcf>   DW_AT_data_member_location: 0
 <2><fd0>: Abbrev Number: 20 (DW_TAG_member)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x1ae): frame
    <fd5>   DW_AT_decl_file   : 9
    <fd6>   DW_AT_decl_line   : 46
    <fd7>   DW_AT_decl_column : 9
    <fd8>   DW_AT_type        : <0xbbc>
    <fdc>   DW_AT_byte_size   : 4
    <fdd>   DW_AT_bit_size    : 20
    <fde>   DW_AT_bit_offset  : 0
    <fdf>   DW_AT_data_member_location: 0
 <2><fe0>: Abbrev Number: 0
 <1><fe1>: Abbrev Number: 12 (DW_TAG_typedef)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x52): vmem_table_entry
    <fe6>   DW_AT_decl_file   : 9
    <fe7>   DW_AT_decl_line   : 47
    <fe8>   DW_AT_decl_column : 3
    <fe9>   DW_AT_type        : <0xf23>
 <1><fed>: Abbrev Number: 22 (DW_TAG_structure_type)
    <fee>   DW_AT_name        : (indirect string, offset: 0x29): vmem
    <ff2>   DW_AT_byte_size   : 4096
    <ff4>   DW_AT_decl_file   : 9
    <ff5>   DW_AT_decl_line   : 53
    <ff6>   DW_AT_decl_column : 16
    <ff7>   DW_AT_sibling     : <0x1009>
 <2><ffb>: Abbrev Number: 7 (DW_TAG_member)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x146): tables
    <1000>   DW_AT_decl_file   : 9
    <1001>   DW_AT_decl_line   : 54
    <1002>   DW_AT_decl_column : 22
    <1003>   DW_AT_type        : <0x1009>
    <1007>   DW_AT_data_member_location: 0
 <2><1008>: Abbrev Number: 0
 <1><1009>: Abbrev Number: 13 (DW_TAG_array_type)
    <100a>   DW_AT_type        : <0xfe1>
    <100e>   DW_AT_sibling     : <0x101a>
 <2><1012>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <1013>   DW_AT_type        : <0xbc8>
    <1017>   DW_AT_upper_bound : 1023
 <2><1019>: Abbrev Number: 0
 <1><101a>: Abbrev Number: 12 (DW_TAG_typedef)
    <101b>   DW_AT_name        : (indirect string, offset: 0x29): vmem
    <101f>   DW_AT_decl_file   : 9
    <1020>   DW_AT_decl_line   : 55
    <1021>   DW_AT_decl_column : 3
    <1022>   DW_AT_type        : <0xfed>
 <1><1026>: Abbrev Number: 9 (DW_TAG_variable)
    <1027>   DW_AT_name        : (indirect string, offset: 0x239): kernel_memory
    <102b>   DW_AT_decl_file   : 9
    <102c>   DW_AT_decl_line   : 57
    <102d>   DW_AT_decl_column : 14
    <102e>   DW_AT_type        : <0x1032>
    <1032>   DW_AT_external    : 1
    <1032>   DW_AT_declaration : 1
 <1><1032>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <1033>   DW_AT_byte_size   : 4
    <1034>   DW_AT_type        : <0x101a>
 <1><1038>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1039>   DW_AT_byte_size   : 12
    <103a>   DW_AT_decl_file   : 10
    <103b>   DW_AT_decl_line   : 16
    <103c>   DW_AT_decl_column : 16
    <103d>   DW_AT_linkage_name: (indirect string, offset: 0x684): 6PARRAY
    <1041>   DW_AT_sibling     : <0x106d>
 <2><1045>: Abbrev Number: 7 (DW_TAG_member)
    <1046>   DW_AT_name        : (indirect string, offset: 0x2f7): buffer
    <104a>   DW_AT_decl_file   : 10
    <104b>   DW_AT_decl_line   : 17
    <104c>   DW_AT_decl_column : 12
    <104d>   DW_AT_type        : <0x106d>
    <1051>   DW_AT_data_member_location: 0
 <2><1052>: Abbrev Number: 7 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0x699): count
    <1057>   DW_AT_decl_file   : 10
    <1058>   DW_AT_decl_line   : 19
    <1059>   DW_AT_decl_column : 12
    <105a>   DW_AT_type        : <0xbbc>
    <105e>   DW_AT_data_member_location: 4
 <2><105f>: Abbrev Number: 7 (DW_TAG_member)
    <1060>   DW_AT_name        : (indirect string, offset: 0x47c): size
    <1064>   DW_AT_decl_file   : 10
    <1065>   DW_AT_decl_line   : 20
    <1066>   DW_AT_decl_column : 12
    <1067>   DW_AT_type        : <0xbbc>
    <106b>   DW_AT_data_member_location: 8
 <2><106c>: Abbrev Number: 0
 <1><106d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <106e>   DW_AT_byte_size   : 4
    <106f>   DW_AT_type        : <0x1073>
 <1><1073>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <1074>   DW_AT_byte_size   : 4
 <1><1075>: Abbrev Number: 12 (DW_TAG_typedef)
    <1076>   DW_AT_name        : (indirect string, offset: 0x685): PARRAY
    <107a>   DW_AT_decl_file   : 10
    <107b>   DW_AT_decl_line   : 21
    <107c>   DW_AT_decl_column : 3
    <107d>   DW_AT_type        : <0x1038>
 <1><1081>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1082>   DW_AT_byte_size   : 16
    <1083>   DW_AT_decl_file   : 10
    <1084>   DW_AT_decl_line   : 23
    <1085>   DW_AT_decl_column : 16
    <1086>   DW_AT_linkage_name: (indirect string, offset: 0x4b8): 5ARRAY
    <108a>   DW_AT_sibling     : <0x10c3>
 <2><108e>: Abbrev Number: 7 (DW_TAG_member)
    <108f>   DW_AT_name        : (indirect string, offset: 0x2f7): buffer
    <1093>   DW_AT_decl_file   : 10
    <1094>   DW_AT_decl_line   : 24
    <1095>   DW_AT_decl_column : 12
    <1096>   DW_AT_type        : <0x106d>
    <109a>   DW_AT_data_member_location: 0
